Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
extern volatile __RPC1Rbits_t RPC1Rbits __asm__ ("RPC1R") __attribute__((section("sfrs"), address(0xBF801684)));
#define RPC2R RPC2R
extern volatile uint32_t   RPC2R __attribute__((section("sfrs"), address(0xBF801688)));
typedef struct {
  uint32_t RPC2R:5;
} __RPC2Rbits_t;
extern volatile __RPC2Rbits_t RPC2Rbits __asm__ ("RPC2R") __attribute__((section("sfrs"), address(0xBF801688)));
#define RPC6R RPC6R
extern volatile uint32_t   RPC6R __attribute__((section("sfrs"), address(0xBF801698)));
typedef struct {
  uint32_t RPC6R:5;
} __RPC6Rbits_t;
extern volatile __RPC6Rbits_t RPC6Rbits __asm__ ("RPC6R") __attribute__((section("sfrs"), address(0xBF801698)));
#define RPC7R RPC7R
extern volatile uint32_t   RPC7R __attribute__((section("sfrs"), address(0xBF80169C)));
typedef struct {
  uint32_t RPC7R:5;
} __RPC7Rbits_t;
extern volatile __RPC7Rbits_t RPC7Rbits __asm__ ("RPC7R") __attribute__((section("sfrs"), address(0xBF80169C)));
#define RPC8R RPC8R
extern volatile uint32_t   RPC8R __attribute__((section("sfrs"), address(0xBF8016A0)));
typedef struct {
  uint32_t RPC8R:5;
} __RPC8Rbits_t;
extern volatile __RPC8Rbits_t RPC8Rbits __asm__ ("RPC8R") __attribute__((section("sfrs"), address(0xBF8016A0)));
#define RPC9R RPC9R
extern volatile uint32_t   RPC9R __attribute__((section("sfrs"), address(0xBF8016A4)));
typedef struct {
  uint32_t RPC9R:5;
} __RPC9Rbits_t;
extern volatile __RPC9Rbits_t RPC9Rbits __asm__ ("RPC9R") __attribute__((section("sfrs"), address(0xBF8016A4)));
#define RPC10R RPC10R
extern volatile uint32_t   RPC10R __attribute__((section("sfrs"), address(0xBF8016A8)));
typedef struct {
  uint32_t RPC10R:5;
} __RPC10Rbits_t;
extern volatile __RPC10Rbits_t RPC10Rbits __asm__ ("RPC10R") __attribute__((section("sfrs"), address(0xBF8016A8)));
#define RPC12R RPC12R
extern volatile uint32_t   RPC12R __attribute__((section("sfrs"), address(0xBF8016B0)));
typedef struct {
  uint32_t RPC12R:5;
} __RPC12Rbits_t;
extern volatile __RPC12Rbits_t RPC12Rbits __asm__ ("RPC12R") __attribute__((section("sfrs"), address(0xBF8016B0)));
#define RPC15R RPC15R
extern volatile uint32_t   RPC15R __attribute__((section("sfrs"), address(0xBF8016BC)));
typedef struct {
  uint32_t RPC15R:5;
} __RPC15Rbits_t;
extern volatile __RPC15Rbits_t RPC15Rbits __asm__ ("RPC15R") __attribute__((section("sfrs"), address(0xBF8016BC)));
#define RPD8R RPD8R
extern volatile uint32_t   RPD8R __attribute__((section("sfrs"), address(0xBF8016E0)));
typedef struct {
  uint32_t RPD8R:5;
} __RPD8Rbits_t;
extern volatile __RPD8Rbits_t RPD8Rbits __asm__ ("RPD8R") __attribute__((section("sfrs"), address(0xBF8016E0)));
#define HLVDCON HLVDCON
extern volatile uint32_t   HLVDCON __attribute__((section("sfrs"), address(0xBF801800)));
typedef struct {
  uint32_t HLVDL:4;
  uint32_t :4;
  uint32_t HLEVT:1;
  uint32_t :1;
  uint32_t BGVST:1;
  uint32_t VDIR:1;
  uint32_t :1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __HLVDCONbits_t;
extern volatile __HLVDCONbits_t HLVDCONbits __asm__ ("HLVDCON") __attribute__((section("sfrs"), address(0xBF801800)));
extern volatile uint32_t        HLVDCONCLR __attribute__((section("sfrs"),address(0xBF801804)));
extern volatile uint32_t        HLVDCONSET __attribute__((section("sfrs"),address(0xBF801808)));
extern volatile uint32_t        HLVDCONINV __attribute__((section("sfrs"),address(0xBF80180C)));
#define INTCON INTCON
extern volatile uint32_t   INTCON __attribute__((section("sfrs"), address(0xBF810000)));
typedef struct {
  uint32_t INT0EP:1;
  uint32_t INT1EP:1;
  uint32_t INT2EP:1;
  uint32_t INT3EP:1;
  uint32_t INT4EP:1;
  uint32_t :3;
  uint32_t TPC:3;
  uint32_t :1;
  uint32_t MVEC:1;
  uint32_t :11;
  uint32_t NMIKEY:8;
} __INTCONbits_t;
extern volatile __INTCONbits_t INTCONbits __asm__ ("INTCON") __attribute__((section("sfrs"), address(0xBF810000)));
extern volatile uint32_t        INTCONCLR __attribute__((section("sfrs"),address(0xBF810004)));
extern volatile uint32_t        INTCONSET __attribute__((section("sfrs"),address(0xBF810008)));
extern volatile uint32_t        INTCONINV __attribute__((section("sfrs"),address(0xBF81000C)));
#define PRISS PRISS
extern volatile uint32_t   PRISS __attribute__((section("sfrs"), address(0xBF810010)));
typedef struct {
  uint32_t SS0:1;
  uint32_t :3;
  uint32_t PRI1SS:4;
  uint32_t PRI2SS:4;
  uint32_t PRI3SS:4;
  uint32_t PRI4SS:4;
  uint32_t PRI5SS:4;
  uint32_t PRI6SS:4;
  uint32_t PRI7SS:4;
} __PRISSbits_t;
extern volatile __PRISSbits_t PRISSbits __asm__ ("PRISS") __attribute__((section("sfrs"), address(0xBF810010)));
extern volatile uint32_t        PRISSCLR __attribute__((section("sfrs"),address(0xBF810014)));
extern volatile uint32_t        PRISSSET __attribute__((section("sfrs"),address(0xBF810018)));
extern volatile uint32_t        PRISSINV __attribute__((section("sfrs"),address(0xBF81001C)));
#define INTSTAT INTSTAT
extern volatile uint32_t   INTSTAT __attribute__((section("sfrs"), address(0xBF810020)));
typedef struct {
  uint32_t SIRQ:8;
  uint32_t SRIPL:3;
} __INTSTATbits_t;
extern volatile __INTSTATbits_t INTSTATbits __asm__ ("INTSTAT") __attribute__((section("sfrs"), address(0xBF810020)));
extern volatile uint32_t        INTSTATCLR __attribute__((section("sfrs"),address(0xBF810024)));
extern volatile uint32_t        INTSTATSET __attribute__((section("sfrs"),address(0xBF810028)));
extern volatile uint32_t        INTSTATINV __attribute__((section("sfrs"),address(0xBF81002C)));
#define IPTMR IPTMR
extern volatile uint32_t   IPTMR __attribute__((section("sfrs"), address(0xBF810030)));
typedef struct {
  uint32_t IPTMR:32;
} __IPTMRbits_t;
extern volatile __IPTMRbits_t IPTMRbits __asm__ ("IPTMR") __attribute__((section("sfrs"), address(0xBF810030)));
extern volatile uint32_t        IPTMRCLR __attribute__((section("sfrs"),address(0xBF810034)));
extern volatile uint32_t        IPTMRSET __attribute__((section("sfrs"),address(0xBF810038)));
extern volatile uint32_t        IPTMRINV __attribute__((section("sfrs"),address(0xBF81003C)));
#define IFS0 IFS0
extern volatile uint32_t   IFS0 __attribute__((section("sfrs"), address(0xBF810040)));
typedef union {
  struct {
    uint32_t CTIF:1;
    uint32_t CS0IF:1;
    uint32_t CS1IF:1;
    uint32_t INT0IF:1;
    uint32_t T1IF:1;
    uint32_t IC1EIF:1;
    uint32_t IC1IF:1;
    uint32_t OC1IF:1;
    uint32_t INT1IF:1;
    uint32_t T2IF:1;
    uint32_t IC2EIF:1;
    uint32_t IC2IF:1;
    uint32_t OC2IF:1;
    uint32_t INT2IF:1;
    uint32_t T3IF:1;
    uint32_t IC3EIF:1;
    uint32_t IC3IF:1;
    uint32_t OC3IF:1;
    uint32_t INT3IF:1;
    uint32_t T4IF:1;
    uint32_t IC4EIF:1;
    uint32_t IC4IF:1;
    uint32_t OC4IF:1;
    uint32_t INT4IF:1;
    uint32_t T5IF:1;
    uint32_t :5;
    uint32_t RTCCIF:1;
    uint32_t FCEIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS0bits_t;
extern volatile __IFS0bits_t IFS0bits __asm__ ("IFS0") __attribute__((section("sfrs"), address(0xBF810040)));
extern volatile uint32_t        IFS0CLR __attribute__((section("sfrs"),address(0xBF810044)));
extern volatile uint32_t        IFS0SET __attribute__((section("sfrs"),address(0xBF810048)));
extern volatile uint32_t        IFS0INV __attribute__((section("sfrs"),address(0xBF81004C)));
#define IFS1 IFS1
extern volatile uint32_t   IFS1 __attribute__((section("sfrs"), address(0xBF810050)));
typedef union {
  struct {
    uint32_t CMP1IF:1;
    uint32_t CMP2IF:1;
    uint32_t :1;
    uint32_t SPI1EIF:1;
    uint32_t SPI1RXIF:1;
    uint32_t SPI1TXIF:1;
    uint32_t U1EIF:1;
    uint32_t U1RXIF:1;
    uint32_t U1TXIF:1;
    uint32_t I2C1BIF:1;
    uint32_t I2C1SIF:1;
    uint32_t I2C1MIF:1;
    uint32_t CNAIF:1;
    uint32_t CNBIF:1;
    uint32_t CNCIF:1;
    uint32_t CNDIF:1;
    uint32_t :5;
    uint32_t SPI2EIF:1;
    uint32_t SPI2RXIF:1;
    uint32_t SPI2TXIF:1;
    uint32_t U2EIF:1;
    uint32_t U2RXIF:1;
    uint32_t U2TXIF:1;
    uint32_t I2C2BIF:1;
    uint32_t I2C2SIF:1;
    uint32_t I2C2MIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS1bits_t;
extern volatile __IFS1bits_t IFS1bits __asm__ ("IFS1") __attribute__((section("sfrs"), address(0xBF810050)));
extern volatile uint32_t        IFS1CLR __attribute__((section("sfrs"),address(0xBF810054)));
extern volatile uint32_t        IFS1SET __attribute__((section("sfrs"),address(0xBF810058)));
extern volatile uint32_t        IFS1INV __attribute__((section("sfrs"),address(0xBF81005C)));
#define IFS2 IFS2
extern volatile uint32_t   IFS2 __attribute__((section("sfrs"), address(0xBF810060)));
typedef union {
  struct {
    uint32_t :7;
    uint32_t CTMUIF:1;
    uint32_t DMA0IF:1;
    uint32_t DMA1IF:1;
    uint32_t DMA2IF:1;
    uint32_t DMA3IF:1;
    uint32_t :16;
    uint32_t AD1IF:1;
    uint32_t :1;
    uint32_t AD1DC1IF:1;
    uint32_t AD1DC2IF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS2bits_t;
