Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
extern volatile __IPC15bits_t IPC15bits __asm__ ("IPC15") __attribute__((section("sfrs"), address(0xBF810230)));
extern volatile uint32_t        IPC15CLR __attribute__((section("sfrs"),address(0xBF810234)));
extern volatile uint32_t        IPC15SET __attribute__((section("sfrs"),address(0xBF810238)));
extern volatile uint32_t        IPC15INV __attribute__((section("sfrs"),address(0xBF81023C)));
#define IPC17 IPC17
extern volatile uint32_t   IPC17 __attribute__((section("sfrs"), address(0xBF810250)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t CTMUIS:2;
    uint32_t CTMUIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC17bits_t;
extern volatile __IPC17bits_t IPC17bits __asm__ ("IPC17") __attribute__((section("sfrs"), address(0xBF810250)));
extern volatile uint32_t        IPC17CLR __attribute__((section("sfrs"),address(0xBF810254)));
extern volatile uint32_t        IPC17SET __attribute__((section("sfrs"),address(0xBF810258)));
extern volatile uint32_t        IPC17INV __attribute__((section("sfrs"),address(0xBF81025C)));
#define IPC18 IPC18
extern volatile uint32_t   IPC18 __attribute__((section("sfrs"), address(0xBF810260)));
typedef union {
  struct {
    uint32_t DMA0IS:2;
    uint32_t DMA0IP:3;
    uint32_t :3;
    uint32_t DMA1IS:2;
    uint32_t DMA1IP:3;
    uint32_t :3;
    uint32_t DMA2IS:2;
    uint32_t DMA2IP:3;
    uint32_t :3;
    uint32_t DMA3IS:2;
    uint32_t DMA3IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC18bits_t;
extern volatile __IPC18bits_t IPC18bits __asm__ ("IPC18") __attribute__((section("sfrs"), address(0xBF810260)));
extern volatile uint32_t        IPC18CLR __attribute__((section("sfrs"),address(0xBF810264)));
extern volatile uint32_t        IPC18SET __attribute__((section("sfrs"),address(0xBF810268)));
extern volatile uint32_t        IPC18INV __attribute__((section("sfrs"),address(0xBF81026C)));
#define IPC23 IPC23
extern volatile uint32_t   IPC23 __attribute__((section("sfrs"), address(0xBF8102B0)));
typedef union {
  struct {
    uint32_t AD1IS:2;
    uint32_t AD1IP:3;
    uint32_t :11;
    uint32_t AD1DC1IS:2;
    uint32_t AD1DC1IP:3;
    uint32_t :3;
    uint32_t AD1DC2IS:2;
    uint32_t AD1DC2IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC23bits_t;
extern volatile __IPC23bits_t IPC23bits __asm__ ("IPC23") __attribute__((section("sfrs"), address(0xBF8102B0)));
extern volatile uint32_t        IPC23CLR __attribute__((section("sfrs"),address(0xBF8102B4)));
extern volatile uint32_t        IPC23SET __attribute__((section("sfrs"),address(0xBF8102B8)));
extern volatile uint32_t        IPC23INV __attribute__((section("sfrs"),address(0xBF8102BC)));
#define IPC24 IPC24
extern volatile uint32_t   IPC24 __attribute__((section("sfrs"), address(0xBF8102C0)));
typedef union {
  struct {
    uint32_t AD1DF1IS:2;
    uint32_t AD1DF1IP:3;
    uint32_t :3;
    uint32_t AD1DF2IS:2;
    uint32_t AD1DF2IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC24bits_t;
extern volatile __IPC24bits_t IPC24bits __asm__ ("IPC24") __attribute__((section("sfrs"), address(0xBF8102C0)));
extern volatile uint32_t        IPC24CLR __attribute__((section("sfrs"),address(0xBF8102C4)));
extern volatile uint32_t        IPC24SET __attribute__((section("sfrs"),address(0xBF8102C8)));
extern volatile uint32_t        IPC24INV __attribute__((section("sfrs"),address(0xBF8102CC)));
#define IPC25 IPC25
extern volatile uint32_t   IPC25 __attribute__((section("sfrs"), address(0xBF8102D0)));
typedef union {
  struct {
    uint32_t AD1F1IS:2;
    uint32_t AD1F1IP:3;
    uint32_t :3;
    uint32_t AD1EOSIS:2;
    uint32_t AD1EOSIP:3;
    uint32_t :3;
    uint32_t AD1ARIS:2;
    uint32_t AD1ARIP:3;
    uint32_t :3;
    uint32_t AD1RSIS:2;
    uint32_t AD1RSIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC25bits_t;
extern volatile __IPC25bits_t IPC25bits __asm__ ("IPC25") __attribute__((section("sfrs"), address(0xBF8102D0)));
extern volatile uint32_t        IPC25CLR __attribute__((section("sfrs"),address(0xBF8102D4)));
extern volatile uint32_t        IPC25SET __attribute__((section("sfrs"),address(0xBF8102D8)));
extern volatile uint32_t        IPC25INV __attribute__((section("sfrs"),address(0xBF8102DC)));
#define IPC26 IPC26
extern volatile uint32_t   IPC26 __attribute__((section("sfrs"), address(0xBF8102E0)));
typedef union {
  struct {
    uint32_t AD1FCBTIS:2;
    uint32_t AD1FCBTIP:3;
    uint32_t :3;
    uint32_t AD1G1IS:2;
    uint32_t AD1G1IP:3;
    uint32_t :3;
    uint32_t AD1D0IS:2;
    uint32_t AD1D0IP:3;
    uint32_t :3;
    uint32_t AD1D1IS:2;
    uint32_t AD1D1IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC26bits_t;
extern volatile __IPC26bits_t IPC26bits __asm__ ("IPC26") __attribute__((section("sfrs"), address(0xBF8102E0)));
extern volatile uint32_t        IPC26CLR __attribute__((section("sfrs"),address(0xBF8102E4)));
extern volatile uint32_t        IPC26SET __attribute__((section("sfrs"),address(0xBF8102E8)));
extern volatile uint32_t        IPC26INV __attribute__((section("sfrs"),address(0xBF8102EC)));
#define IPC27 IPC27
extern volatile uint32_t   IPC27 __attribute__((section("sfrs"), address(0xBF8102F0)));
typedef union {
  struct {
    uint32_t AD1D2IS:2;
    uint32_t AD1D2IP:3;
    uint32_t :3;
    uint32_t AD1D3IS:2;
    uint32_t AD1D3IP:3;
    uint32_t :3;
    uint32_t AD1D4IS:2;
    uint32_t AD1D4IP:3;
    uint32_t :3;
    uint32_t AD1D5IS:2;
    uint32_t AD1D5IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC27bits_t;
extern volatile __IPC27bits_t IPC27bits __asm__ ("IPC27") __attribute__((section("sfrs"), address(0xBF8102F0)));
extern volatile uint32_t        IPC27CLR __attribute__((section("sfrs"),address(0xBF8102F4)));
extern volatile uint32_t        IPC27SET __attribute__((section("sfrs"),address(0xBF8102F8)));
extern volatile uint32_t        IPC27INV __attribute__((section("sfrs"),address(0xBF8102FC)));
#define IPC28 IPC28
extern volatile uint32_t   IPC28 __attribute__((section("sfrs"), address(0xBF810300)));
typedef struct {
  uint32_t w:32;
} __IPC28bits_t;
extern volatile __IPC28bits_t IPC28bits __asm__ ("IPC28") __attribute__((section("sfrs"), address(0xBF810300)));
extern volatile uint32_t        IPC28CLR __attribute__((section("sfrs"),address(0xBF810304)));
extern volatile uint32_t        IPC28SET __attribute__((section("sfrs"),address(0xBF810308)));
extern volatile uint32_t        IPC28INV __attribute__((section("sfrs"),address(0xBF81030C)));
#define IPC29 IPC29
extern volatile uint32_t   IPC29 __attribute__((section("sfrs"), address(0xBF810310)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t AD1D13IS:2;
    uint32_t AD1D13IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC29bits_t;
extern volatile __IPC29bits_t IPC29bits __asm__ ("IPC29") __attribute__((section("sfrs"), address(0xBF810310)));
extern volatile uint32_t        IPC29CLR __attribute__((section("sfrs"),address(0xBF810314)));
extern volatile uint32_t        IPC29SET __attribute__((section("sfrs"),address(0xBF810318)));
extern volatile uint32_t        IPC29INV __attribute__((section("sfrs"),address(0xBF81031C)));
#define IPC30 IPC30
extern volatile uint32_t   IPC30 __attribute__((section("sfrs"), address(0xBF810320)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t AD1D15IS:2;
    uint32_t AD1D15IP:3;
    uint32_t :3;
    uint32_t AD1D16IS:2;
    uint32_t AD1D16IP:3;
    uint32_t :3;
    uint32_t AD1D17IS:2;
    uint32_t AD1D17IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC30bits_t;
