Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
extern volatile __STRIG2bits_t STRIG2bits __asm__ ("STRIG2") __attribute__((section("sfrs"), address(0xBF82A260)));
extern volatile uint32_t        STRIG2CLR __attribute__((section("sfrs"),address(0xBF82A264)));
extern volatile uint32_t        STRIG2SET __attribute__((section("sfrs"),address(0xBF82A268)));
extern volatile uint32_t        STRIG2INV __attribute__((section("sfrs"),address(0xBF82A26C)));
#define CAP2 CAP2
extern volatile uint32_t   CAP2 __attribute__((section("sfrs"), address(0xBF82A270)));
typedef struct {
  uint32_t CAP:16;
} __CAP2bits_t;
extern volatile __CAP2bits_t CAP2bits __asm__ ("CAP2") __attribute__((section("sfrs"), address(0xBF82A270)));
extern volatile uint32_t        CAP2CLR __attribute__((section("sfrs"),address(0xBF82A274)));
extern volatile uint32_t        CAP2SET __attribute__((section("sfrs"),address(0xBF82A278)));
extern volatile uint32_t        CAP2INV __attribute__((section("sfrs"),address(0xBF82A27C)));
#define LEBCON2 LEBCON2
extern volatile uint32_t   LEBCON2 __attribute__((section("sfrs"), address(0xBF82A280)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON2bits_t;
extern volatile __LEBCON2bits_t LEBCON2bits __asm__ ("LEBCON2") __attribute__((section("sfrs"), address(0xBF82A280)));
extern volatile uint32_t        LEBCON2CLR __attribute__((section("sfrs"),address(0xBF82A284)));
extern volatile uint32_t        LEBCON2SET __attribute__((section("sfrs"),address(0xBF82A288)));
extern volatile uint32_t        LEBCON2INV __attribute__((section("sfrs"),address(0xBF82A28C)));
#define LEBDLY2 LEBDLY2
extern volatile uint32_t   LEBDLY2 __attribute__((section("sfrs"), address(0xBF82A290)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY2bits_t;
extern volatile __LEBDLY2bits_t LEBDLY2bits __asm__ ("LEBDLY2") __attribute__((section("sfrs"), address(0xBF82A290)));
extern volatile uint32_t        LEBDLY2CLR __attribute__((section("sfrs"),address(0xBF82A294)));
extern volatile uint32_t        LEBDLY2SET __attribute__((section("sfrs"),address(0xBF82A298)));
extern volatile uint32_t        LEBDLY2INV __attribute__((section("sfrs"),address(0xBF82A29C)));
#define AUXCON2 AUXCON2
extern volatile uint32_t   AUXCON2 __attribute__((section("sfrs"), address(0xBF82A2A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON2bits_t;
extern volatile __AUXCON2bits_t AUXCON2bits __asm__ ("AUXCON2") __attribute__((section("sfrs"), address(0xBF82A2A0)));
extern volatile uint32_t        AUXCON2CLR __attribute__((section("sfrs"),address(0xBF82A2A4)));
extern volatile uint32_t        AUXCON2SET __attribute__((section("sfrs"),address(0xBF82A2A8)));
extern volatile uint32_t        AUXCON2INV __attribute__((section("sfrs"),address(0xBF82A2AC)));
#define PTMR2 PTMR2
extern volatile uint32_t   PTMR2 __attribute__((section("sfrs"), address(0xBF82A2B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR2bits_t;
extern volatile __PTMR2bits_t PTMR2bits __asm__ ("PTMR2") __attribute__((section("sfrs"), address(0xBF82A2B0)));
extern volatile uint32_t        PTMR2CLR __attribute__((section("sfrs"),address(0xBF82A2B4)));
extern volatile uint32_t        PTMR2SET __attribute__((section("sfrs"),address(0xBF82A2B8)));
extern volatile uint32_t        PTMR2INV __attribute__((section("sfrs"),address(0xBF82A2BC)));
#define PWMCON3 PWMCON3
extern volatile uint32_t   PWMCON3 __attribute__((section("sfrs"), address(0xBF82A2C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON3bits_t;
extern volatile __PWMCON3bits_t PWMCON3bits __asm__ ("PWMCON3") __attribute__((section("sfrs"), address(0xBF82A2C0)));
extern volatile uint32_t        PWMCON3CLR __attribute__((section("sfrs"),address(0xBF82A2C4)));
extern volatile uint32_t        PWMCON3SET __attribute__((section("sfrs"),address(0xBF82A2C8)));
extern volatile uint32_t        PWMCON3INV __attribute__((section("sfrs"),address(0xBF82A2CC)));
#define IOCON3 IOCON3
extern volatile uint32_t   IOCON3 __attribute__((section("sfrs"), address(0xBF82A2D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON3bits_t;
extern volatile __IOCON3bits_t IOCON3bits __asm__ ("IOCON3") __attribute__((section("sfrs"), address(0xBF82A2D0)));
extern volatile uint32_t        IOCON3CLR __attribute__((section("sfrs"),address(0xBF82A2D4)));
extern volatile uint32_t        IOCON3SET __attribute__((section("sfrs"),address(0xBF82A2D8)));
extern volatile uint32_t        IOCON3INV __attribute__((section("sfrs"),address(0xBF82A2DC)));
#define PDC3 PDC3
extern volatile uint32_t   PDC3 __attribute__((section("sfrs"), address(0xBF82A2E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC3bits_t;
extern volatile __PDC3bits_t PDC3bits __asm__ ("PDC3") __attribute__((section("sfrs"), address(0xBF82A2E0)));
extern volatile uint32_t        PDC3CLR __attribute__((section("sfrs"),address(0xBF82A2E4)));
extern volatile uint32_t        PDC3SET __attribute__((section("sfrs"),address(0xBF82A2E8)));
extern volatile uint32_t        PDC3INV __attribute__((section("sfrs"),address(0xBF82A2EC)));
#define SDC3 SDC3
extern volatile uint32_t   SDC3 __attribute__((section("sfrs"), address(0xBF82A2F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC3bits_t;
