Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
extern volatile __DAC1CONbits_t DAC1CONbits __asm__ ("DAC1CON") __attribute__((section("sfrs"), address(0xBF82C600)));
extern volatile uint32_t        DAC1CONCLR __attribute__((section("sfrs"),address(0xBF82C604)));
extern volatile uint32_t        DAC1CONSET __attribute__((section("sfrs"),address(0xBF82C608)));
extern volatile uint32_t        DAC1CONINV __attribute__((section("sfrs"),address(0xBF82C60C)));
#define CTMUCON CTMUCON
extern volatile uint32_t   CTMUCON __attribute__((section("sfrs"), address(0xBF82D000)));
typedef union {
  struct {
    uint32_t IRNG:2;
    uint32_t ITRIM:6;
    uint32_t CTTRIG:1;
    uint32_t IDISSEN:1;
    uint32_t EDGSEQEN:1;
    uint32_t EDGEN:1;
    uint32_t TGEN:1;
    uint32_t CTMUSIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :2;
    uint32_t EDG2SEL:4;
    uint32_t EDG2POL:1;
    uint32_t EDG2MOD:1;
    uint32_t EDG1STAT:1;
    uint32_t EDG2STAT:1;
    uint32_t EDG1SEL:4;
    uint32_t EDG1POL:1;
    uint32_t EDG1MOD:1;
  };
  struct {
    uint32_t w:32;
  };
} __CTMUCONbits_t;
extern volatile __CTMUCONbits_t CTMUCONbits __asm__ ("CTMUCON") __attribute__((section("sfrs"), address(0xBF82D000)));
extern volatile uint32_t        CTMUCONCLR __attribute__((section("sfrs"),address(0xBF82D004)));
extern volatile uint32_t        CTMUCONSET __attribute__((section("sfrs"),address(0xBF82D008)));
extern volatile uint32_t        CTMUCONINV __attribute__((section("sfrs"),address(0xBF82D00C)));
#define CLC1CON CLC1CON
extern volatile uint32_t   CLC1CON __attribute__((section("sfrs"), address(0xBF82D200)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC1CONbits_t;
extern volatile __CLC1CONbits_t CLC1CONbits __asm__ ("CLC1CON") __attribute__((section("sfrs"), address(0xBF82D200)));
extern volatile uint32_t        CLC1CONCLR __attribute__((section("sfrs"),address(0xBF82D204)));
extern volatile uint32_t        CLC1CONSET __attribute__((section("sfrs"),address(0xBF82D208)));
extern volatile uint32_t        CLC1CONINV __attribute__((section("sfrs"),address(0xBF82D20C)));
#define CLC1SEL CLC1SEL
extern volatile uint32_t   CLC1SEL __attribute__((section("sfrs"), address(0xBF82D210)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC1SELbits_t;
extern volatile __CLC1SELbits_t CLC1SELbits __asm__ ("CLC1SEL") __attribute__((section("sfrs"), address(0xBF82D210)));
extern volatile uint32_t        CLC1SELCLR __attribute__((section("sfrs"),address(0xBF82D214)));
extern volatile uint32_t        CLC1SELSET __attribute__((section("sfrs"),address(0xBF82D218)));
extern volatile uint32_t        CLC1SELINV __attribute__((section("sfrs"),address(0xBF82D21C)));
#define CLC1GLS CLC1GLS
extern volatile uint32_t   CLC1GLS __attribute__((section("sfrs"), address(0xBF82D220)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC1GLSbits_t;
extern volatile __CLC1GLSbits_t CLC1GLSbits __asm__ ("CLC1GLS") __attribute__((section("sfrs"), address(0xBF82D220)));
extern volatile uint32_t        CLC1GLSCLR __attribute__((section("sfrs"),address(0xBF82D224)));
extern volatile uint32_t        CLC1GLSSET __attribute__((section("sfrs"),address(0xBF82D228)));
extern volatile uint32_t        CLC1GLSINV __attribute__((section("sfrs"),address(0xBF82D22C)));
#define ANSELA ANSELA
extern volatile uint32_t   ANSELA __attribute__((section("sfrs"), address(0xBF860000)));
typedef union {
  struct {
    uint32_t ANSA0:1;
    uint32_t ANSA1:1;
    uint32_t :2;
    uint32_t ANSA4:1;
    uint32_t :2;
    uint32_t ANSA7:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELAbits_t;
extern volatile __ANSELAbits_t ANSELAbits __asm__ ("ANSELA") __attribute__((section("sfrs"), address(0xBF860000)));
extern volatile uint32_t        ANSELACLR __attribute__((section("sfrs"),address(0xBF860004)));
extern volatile uint32_t        ANSELASET __attribute__((section("sfrs"),address(0xBF860008)));
extern volatile uint32_t        ANSELAINV __attribute__((section("sfrs"),address(0xBF86000C)));
#define TRISA TRISA
extern volatile uint32_t   TRISA __attribute__((section("sfrs"), address(0xBF860010)));
typedef union {
  struct {
    uint32_t TRISA0:1;
    uint32_t TRISA1:1;
    uint32_t :2;
    uint32_t TRISA4:1;
    uint32_t :5;
    uint32_t TRISA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISAbits_t;
extern volatile __TRISAbits_t TRISAbits __asm__ ("TRISA") __attribute__((section("sfrs"), address(0xBF860010)));
extern volatile uint32_t        TRISACLR __attribute__((section("sfrs"),address(0xBF860014)));
extern volatile uint32_t        TRISASET __attribute__((section("sfrs"),address(0xBF860018)));
extern volatile uint32_t        TRISAINV __attribute__((section("sfrs"),address(0xBF86001C)));
#define PORTA PORTA
extern volatile uint32_t   PORTA __attribute__((section("sfrs"), address(0xBF860020)));
typedef union {
  struct {
    uint32_t RA0:1;
    uint32_t RA1:1;
    uint32_t :2;
    uint32_t RA4:1;
    uint32_t :5;
    uint32_t RA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTAbits_t;
extern volatile __PORTAbits_t PORTAbits __asm__ ("PORTA") __attribute__((section("sfrs"), address(0xBF860020)));
extern volatile uint32_t        PORTACLR __attribute__((section("sfrs"),address(0xBF860024)));
extern volatile uint32_t        PORTASET __attribute__((section("sfrs"),address(0xBF860028)));
extern volatile uint32_t        PORTAINV __attribute__((section("sfrs"),address(0xBF86002C)));
#define LATA LATA
extern volatile uint32_t   LATA __attribute__((section("sfrs"), address(0xBF860030)));
typedef union {
  struct {
    uint32_t LATA0:1;
    uint32_t LATA1:1;
    uint32_t :2;
    uint32_t LATA4:1;
    uint32_t :5;
    uint32_t LATA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATAbits_t;
extern volatile __LATAbits_t LATAbits __asm__ ("LATA") __attribute__((section("sfrs"), address(0xBF860030)));
extern volatile uint32_t        LATACLR __attribute__((section("sfrs"),address(0xBF860034)));
extern volatile uint32_t        LATASET __attribute__((section("sfrs"),address(0xBF860038)));
extern volatile uint32_t        LATAINV __attribute__((section("sfrs"),address(0xBF86003C)));
#define ODCA ODCA
extern volatile uint32_t   ODCA __attribute__((section("sfrs"), address(0xBF860040)));
typedef union {
  struct {
    uint32_t ODCA0:1;
    uint32_t ODCA1:1;
    uint32_t :2;
    uint32_t ODCA4:1;
    uint32_t :5;
    uint32_t ODCA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCAbits_t;
extern volatile __ODCAbits_t ODCAbits __asm__ ("ODCA") __attribute__((section("sfrs"), address(0xBF860040)));
extern volatile uint32_t        ODCACLR __attribute__((section("sfrs"),address(0xBF860044)));
extern volatile uint32_t        ODCASET __attribute__((section("sfrs"),address(0xBF860048)));
extern volatile uint32_t        ODCAINV __attribute__((section("sfrs"),address(0xBF86004C)));
#define CNPUA CNPUA
extern volatile uint32_t   CNPUA __attribute__((section("sfrs"), address(0xBF860050)));
typedef union {
  struct {
    uint32_t CNPUA0:1;
    uint32_t CNPUA1:1;
    uint32_t :2;
    uint32_t CNPUA4:1;
    uint32_t :5;
    uint32_t CNPUA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUAbits_t;
extern volatile __CNPUAbits_t CNPUAbits __asm__ ("CNPUA") __attribute__((section("sfrs"), address(0xBF860050)));
extern volatile uint32_t        CNPUACLR __attribute__((section("sfrs"),address(0xBF860054)));
extern volatile uint32_t        CNPUASET __attribute__((section("sfrs"),address(0xBF860058)));
extern volatile uint32_t        CNPUAINV __attribute__((section("sfrs"),address(0xBF86005C)));
#define CNPDA CNPDA
extern volatile uint32_t   CNPDA __attribute__((section("sfrs"), address(0xBF860060)));
typedef union {
  struct {
    uint32_t CNPDA0:1;
    uint32_t CNPDA1:1;
    uint32_t :2;
    uint32_t CNPDA4:1;
    uint32_t :5;
    uint32_t CNPDA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDAbits_t;
extern volatile __CNPDAbits_t CNPDAbits __asm__ ("CNPDA") __attribute__((section("sfrs"), address(0xBF860060)));
extern volatile uint32_t        CNPDACLR __attribute__((section("sfrs"),address(0xBF860064)));
extern volatile uint32_t        CNPDASET __attribute__((section("sfrs"),address(0xBF860068)));
extern volatile uint32_t        CNPDAINV __attribute__((section("sfrs"),address(0xBF86006C)));
#define CNCONA CNCONA
extern volatile uint32_t   CNCONA __attribute__((section("sfrs"), address(0xBF860070)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONAbits_t;
extern volatile __CNCONAbits_t CNCONAbits __asm__ ("CNCONA") __attribute__((section("sfrs"), address(0xBF860070)));
extern volatile uint32_t        CNCONACLR __attribute__((section("sfrs"),address(0xBF860074)));
extern volatile uint32_t        CNCONASET __attribute__((section("sfrs"),address(0xBF860078)));
extern volatile uint32_t        CNCONAINV __attribute__((section("sfrs"),address(0xBF86007C)));
#define CNENA CNENA
extern volatile uint32_t   CNENA __attribute__((section("sfrs"), address(0xBF860080)));
typedef union {
  struct {
    uint32_t CNIEA0:1;
    uint32_t CNIEA1:1;
    uint32_t :2;
    uint32_t CNIEA4:1;
    uint32_t :5;
    uint32_t CNIEA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENAbits_t;
extern volatile __CNENAbits_t CNENAbits __asm__ ("CNENA") __attribute__((section("sfrs"), address(0xBF860080)));
extern volatile uint32_t        CNENACLR __attribute__((section("sfrs"),address(0xBF860084)));
extern volatile uint32_t        CNENASET __attribute__((section("sfrs"),address(0xBF860088)));
extern volatile uint32_t        CNENAINV __attribute__((section("sfrs"),address(0xBF86008C)));
#define CNSTATA CNSTATA
extern volatile uint32_t   CNSTATA __attribute__((section("sfrs"), address(0xBF860090)));
typedef union {
  struct {
    uint32_t CNSTATA0:1;
    uint32_t CNSTATA1:1;
    uint32_t :2;
    uint32_t CNSTATA4:1;
    uint32_t :5;
    uint32_t CNSTATA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATAbits_t;
extern volatile __CNSTATAbits_t CNSTATAbits __asm__ ("CNSTATA") __attribute__((section("sfrs"), address(0xBF860090)));
extern volatile uint32_t        CNSTATACLR __attribute__((section("sfrs"),address(0xBF860094)));
extern volatile uint32_t        CNSTATASET __attribute__((section("sfrs"),address(0xBF860098)));
extern volatile uint32_t        CNSTATAINV __attribute__((section("sfrs"),address(0xBF86009C)));
#define CNNEA CNNEA
extern volatile uint32_t   CNNEA __attribute__((section("sfrs"), address(0xBF8600A0)));
typedef struct {
  uint32_t CNNEA0:1;
  uint32_t CNNEA1:1;
  uint32_t :2;
  uint32_t CNNEA4:1;
  uint32_t :5;
  uint32_t CNNEA10:1;
} __CNNEAbits_t;
extern volatile __CNNEAbits_t CNNEAbits __asm__ ("CNNEA") __attribute__((section("sfrs"), address(0xBF8600A0)));
extern volatile uint32_t        CNNEACLR __attribute__((section("sfrs"),address(0xBF8600A4)));
extern volatile uint32_t        CNNEASET __attribute__((section("sfrs"),address(0xBF8600A8)));
extern volatile uint32_t        CNNEAINV __attribute__((section("sfrs"),address(0xBF8600AC)));
#define CNFA CNFA
extern volatile uint32_t   CNFA __attribute__((section("sfrs"), address(0xBF8600B0)));
typedef struct {
  uint32_t CNFA0:1;
  uint32_t CNFA1:1;
  uint32_t :2;
  uint32_t CNFA4:1;
  uint32_t :5;
  uint32_t CNFA10:1;
} __CNFAbits_t;
