Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
extern volatile __CNSTATCbits_t CNSTATCbits __asm__ ("CNSTATC") __attribute__((section("sfrs"), address(0xBF860290)));
extern volatile uint32_t        CNSTATCCLR __attribute__((section("sfrs"),address(0xBF860294)));
extern volatile uint32_t        CNSTATCSET __attribute__((section("sfrs"),address(0xBF860298)));
extern volatile uint32_t        CNSTATCINV __attribute__((section("sfrs"),address(0xBF86029C)));
#define CNNEC CNNEC
extern volatile uint32_t   CNNEC __attribute__((section("sfrs"), address(0xBF8602A0)));
typedef struct {
  uint32_t :12;
  uint32_t CNNEC12:1;
  uint32_t :2;
  uint32_t CNNEC15:1;
} __CNNECbits_t;
extern volatile __CNNECbits_t CNNECbits __asm__ ("CNNEC") __attribute__((section("sfrs"), address(0xBF8602A0)));
extern volatile uint32_t        CNNECCLR __attribute__((section("sfrs"),address(0xBF8602A4)));
extern volatile uint32_t        CNNECSET __attribute__((section("sfrs"),address(0xBF8602A8)));
extern volatile uint32_t        CNNECINV __attribute__((section("sfrs"),address(0xBF8602AC)));
#define CNFC CNFC
extern volatile uint32_t   CNFC __attribute__((section("sfrs"), address(0xBF8602B0)));
typedef struct {
  uint32_t :12;
  uint32_t CNFC12:1;
  uint32_t :2;
  uint32_t CNFC15:1;
} __CNFCbits_t;
extern volatile __CNFCbits_t CNFCbits __asm__ ("CNFC") __attribute__((section("sfrs"), address(0xBF8602B0)));
extern volatile uint32_t        CNFCCLR __attribute__((section("sfrs"),address(0xBF8602B4)));
extern volatile uint32_t        CNFCSET __attribute__((section("sfrs"),address(0xBF8602B8)));
extern volatile uint32_t        CNFCINV __attribute__((section("sfrs"),address(0xBF8602BC)));
#define SRCON0C SRCON0C
extern volatile uint32_t   SRCON0C __attribute__((section("sfrs"), address(0xBF8602C0)));
typedef struct {
  uint32_t :15;
  uint32_t SR0C15:1;
} __SRCON0Cbits_t;
extern volatile __SRCON0Cbits_t SRCON0Cbits __asm__ ("SRCON0C") __attribute__((section("sfrs"), address(0xBF8602C0)));
extern volatile uint32_t        SRCON0CCLR __attribute__((section("sfrs"),address(0xBF8602C4)));
extern volatile uint32_t        SRCON0CSET __attribute__((section("sfrs"),address(0xBF8602C8)));
extern volatile uint32_t        SRCON0CINV __attribute__((section("sfrs"),address(0xBF8602CC)));
#define SRCON1C SRCON1C
extern volatile uint32_t   SRCON1C __attribute__((section("sfrs"), address(0xBF8602D0)));
typedef struct {
  uint32_t :15;
  uint32_t SR1C15:1;
} __SRCON1Cbits_t;
extern volatile __SRCON1Cbits_t SRCON1Cbits __asm__ ("SRCON1C") __attribute__((section("sfrs"), address(0xBF8602D0)));
extern volatile uint32_t        SRCON1CCLR __attribute__((section("sfrs"),address(0xBF8602D4)));
extern volatile uint32_t        SRCON1CSET __attribute__((section("sfrs"),address(0xBF8602D8)));
extern volatile uint32_t        SRCON1CINV __attribute__((section("sfrs"),address(0xBF8602DC)));
#define ANSELD ANSELD
extern volatile uint32_t   ANSELD __attribute__((section("sfrs"), address(0xBF860300)));
typedef struct {
  uint32_t w:32;
} __ANSELDbits_t;
extern volatile __ANSELDbits_t ANSELDbits __asm__ ("ANSELD") __attribute__((section("sfrs"), address(0xBF860300)));
extern volatile uint32_t        ANSELDCLR __attribute__((section("sfrs"),address(0xBF860304)));
extern volatile uint32_t        ANSELDSET __attribute__((section("sfrs"),address(0xBF860308)));
extern volatile uint32_t        ANSELDINV __attribute__((section("sfrs"),address(0xBF86030C)));
#define TRISD TRISD
extern volatile uint32_t   TRISD __attribute__((section("sfrs"), address(0xBF860310)));
typedef struct {
  uint32_t w:32;
} __TRISDbits_t;
extern volatile __TRISDbits_t TRISDbits __asm__ ("TRISD") __attribute__((section("sfrs"), address(0xBF860310)));
extern volatile uint32_t        TRISDCLR __attribute__((section("sfrs"),address(0xBF860314)));
extern volatile uint32_t        TRISDSET __attribute__((section("sfrs"),address(0xBF860318)));
extern volatile uint32_t        TRISDINV __attribute__((section("sfrs"),address(0xBF86031C)));
#define PORTD PORTD
extern volatile uint32_t   PORTD __attribute__((section("sfrs"), address(0xBF860320)));
typedef struct {
  uint32_t w:32;
} __PORTDbits_t;
extern volatile __PORTDbits_t PORTDbits __asm__ ("PORTD") __attribute__((section("sfrs"), address(0xBF860320)));
extern volatile uint32_t        PORTDCLR __attribute__((section("sfrs"),address(0xBF860324)));
extern volatile uint32_t        PORTDSET __attribute__((section("sfrs"),address(0xBF860328)));
extern volatile uint32_t        PORTDINV __attribute__((section("sfrs"),address(0xBF86032C)));
#define LATD LATD
extern volatile uint32_t   LATD __attribute__((section("sfrs"), address(0xBF860330)));
typedef struct {
  uint32_t w:32;
} __LATDbits_t;
extern volatile __LATDbits_t LATDbits __asm__ ("LATD") __attribute__((section("sfrs"), address(0xBF860330)));
extern volatile uint32_t        LATDCLR __attribute__((section("sfrs"),address(0xBF860334)));
extern volatile uint32_t        LATDSET __attribute__((section("sfrs"),address(0xBF860338)));
extern volatile uint32_t        LATDINV __attribute__((section("sfrs"),address(0xBF86033C)));
#define ODCD ODCD
extern volatile uint32_t   ODCD __attribute__((section("sfrs"), address(0xBF860340)));
typedef struct {
  uint32_t w:32;
} __ODCDbits_t;
extern volatile __ODCDbits_t ODCDbits __asm__ ("ODCD") __attribute__((section("sfrs"), address(0xBF860340)));
extern volatile uint32_t        ODCDCLR __attribute__((section("sfrs"),address(0xBF860344)));
extern volatile uint32_t        ODCDSET __attribute__((section("sfrs"),address(0xBF860348)));
extern volatile uint32_t        ODCDINV __attribute__((section("sfrs"),address(0xBF86034C)));
#define CNPDD CNPDD
extern volatile uint32_t   CNPDD __attribute__((section("sfrs"), address(0xBF860360)));
typedef struct {
  uint32_t w:32;
} __CNPDDbits_t;
extern volatile __CNPDDbits_t CNPDDbits __asm__ ("CNPDD") __attribute__((section("sfrs"), address(0xBF860360)));
extern volatile uint32_t        CNPDDCLR __attribute__((section("sfrs"),address(0xBF860364)));
extern volatile uint32_t        CNPDDSET __attribute__((section("sfrs"),address(0xBF860368)));
extern volatile uint32_t        CNPDDINV __attribute__((section("sfrs"),address(0xBF86036C)));
#define CNCOND CNCOND
extern volatile uint32_t   CNCOND __attribute__((section("sfrs"), address(0xBF860370)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONDbits_t;
extern volatile __CNCONDbits_t CNCONDbits __asm__ ("CNCOND") __attribute__((section("sfrs"), address(0xBF860370)));
extern volatile uint32_t        CNCONDCLR __attribute__((section("sfrs"),address(0xBF860374)));
extern volatile uint32_t        CNCONDSET __attribute__((section("sfrs"),address(0xBF860378)));
extern volatile uint32_t        CNCONDINV __attribute__((section("sfrs"),address(0xBF86037C)));
#define CNEND CNEND
extern volatile uint32_t   CNEND __attribute__((section("sfrs"), address(0xBF860380)));
typedef struct {
  uint32_t w:32;
} __CNENDbits_t;
