Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
extern volatile __CNENDbits_t CNENDbits __asm__ ("CNEND") __attribute__((section("sfrs"), address(0xBF860380)));
extern volatile uint32_t        CNENDCLR __attribute__((section("sfrs"),address(0xBF860384)));
extern volatile uint32_t        CNENDSET __attribute__((section("sfrs"),address(0xBF860388)));
extern volatile uint32_t        CNENDINV __attribute__((section("sfrs"),address(0xBF86038C)));
#define CNSTATD CNSTATD
extern volatile uint32_t   CNSTATD __attribute__((section("sfrs"), address(0xBF860390)));
typedef struct {
  uint32_t w:32;
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs"), address(0xBF860390)));
extern volatile uint32_t        CNSTATDCLR __attribute__((section("sfrs"),address(0xBF860394)));
extern volatile uint32_t        CNSTATDSET __attribute__((section("sfrs"),address(0xBF860398)));
extern volatile uint32_t        CNSTATDINV __attribute__((section("sfrs"),address(0xBF86039C)));
#define CNNED CNNED
extern volatile uint32_t   CNNED __attribute__((section("sfrs"), address(0xBF8603A0)));
extern volatile uint32_t        CNNEDCLR __attribute__((section("sfrs"),address(0xBF8603A4)));
extern volatile uint32_t        CNNEDSET __attribute__((section("sfrs"),address(0xBF8603A8)));
extern volatile uint32_t        CNNEDINV __attribute__((section("sfrs"),address(0xBF8603AC)));
#define CNFD CNFD
extern volatile uint32_t   CNFD __attribute__((section("sfrs"), address(0xBF8603B0)));
extern volatile uint32_t        CNFDCLR __attribute__((section("sfrs"),address(0xBF8603B4)));
extern volatile uint32_t        CNFDSET __attribute__((section("sfrs"),address(0xBF8603B8)));
extern volatile uint32_t        CNFDINV __attribute__((section("sfrs"),address(0xBF8603BC)));
#define SRCON0D SRCON0D
extern volatile uint32_t   SRCON0D __attribute__((section("sfrs"), address(0xBF8603C0)));
extern volatile uint32_t        SRCON0DCLR __attribute__((section("sfrs"),address(0xBF8603C4)));
extern volatile uint32_t        SRCON0DSET __attribute__((section("sfrs"),address(0xBF8603C8)));
extern volatile uint32_t        SRCON0DINV __attribute__((section("sfrs"),address(0xBF8603CC)));
#define SRCON1D SRCON1D
extern volatile uint32_t   SRCON1D __attribute__((section("sfrs"), address(0xBF8603D0)));
extern volatile uint32_t        SRCON1DCLR __attribute__((section("sfrs"),address(0xBF8603D4)));
extern volatile uint32_t        SRCON1DSET __attribute__((section("sfrs"),address(0xBF8603D8)));
extern volatile uint32_t        SRCON1DINV __attribute__((section("sfrs"),address(0xBF8603DC)));
#define ADCCON1 ADCCON1
extern volatile uint32_t   ADCCON1 __attribute__((section("sfrs"), address(0xBF887000)));
typedef struct {
  uint32_t DMABL:3;
  uint32_t STRGLVL:1;
  uint32_t IRQVS:3;
  uint32_t :2;
  uint32_t FSPBCLKEN:1;
  uint32_t FSSCLKEN:1;
  uint32_t :1;
  uint32_t AICPMPEN:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t STRGSRC:5;
  uint32_t SELRES:2;
  uint32_t FRACT:1;
  uint32_t TRBSLV:3;
  uint32_t TRBMST:3;
  uint32_t TRBERR:1;
  uint32_t TRBEN:1;
} __ADCCON1bits_t;
extern volatile __ADCCON1bits_t ADCCON1bits __asm__ ("ADCCON1") __attribute__((section("sfrs"), address(0xBF887000)));
extern volatile uint32_t        ADCCON1CLR __attribute__((section("sfrs"),address(0xBF887004)));
extern volatile uint32_t        ADCCON1SET __attribute__((section("sfrs"),address(0xBF887008)));
extern volatile uint32_t        ADCCON1INV __attribute__((section("sfrs"),address(0xBF88700C)));
#define ADCCON2 ADCCON2
extern volatile uint32_t   ADCCON2 __attribute__((section("sfrs"), address(0xBF887010)));
typedef struct {
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t ADCEIS:3;
  uint32_t :1;
  uint32_t ADCEIOVR:1;
  uint32_t EOSIEN:1;
  uint32_t REFFLTIEN:1;
  uint32_t BGVRIEN:1;
  uint32_t SAMC:10;
  uint32_t :3;
  uint32_t EOSRDY:1;
  uint32_t REFFLT:1;
  uint32_t BGVRRDY:1;
} __ADCCON2bits_t;
extern volatile __ADCCON2bits_t ADCCON2bits __asm__ ("ADCCON2") __attribute__((section("sfrs"), address(0xBF887010)));
extern volatile uint32_t        ADCCON2CLR __attribute__((section("sfrs"),address(0xBF887014)));
extern volatile uint32_t        ADCCON2SET __attribute__((section("sfrs"),address(0xBF887018)));
extern volatile uint32_t        ADCCON2INV __attribute__((section("sfrs"),address(0xBF88701C)));
#define ADCCON3 ADCCON3
extern volatile uint32_t   ADCCON3 __attribute__((section("sfrs"), address(0xBF887020)));
typedef struct {
  uint32_t ADINSEL:6;
  uint32_t GSWTRG:1;
  uint32_t GLSWTRG:1;
  uint32_t RQCNVRT:1;
  uint32_t SAMP:1;
  uint32_t UPDRDY:1;
  uint32_t UPDIEN:1;
  uint32_t TRGSUSP:1;
  uint32_t VREFSEL:3;
  uint32_t DIGEN0:1;
  uint32_t DIGEN1:1;
  uint32_t :5;
  uint32_t DIGEN7:1;
  uint32_t CONCLKDIV:6;
  uint32_t ADCSEL:2;
} __ADCCON3bits_t;
extern volatile __ADCCON3bits_t ADCCON3bits __asm__ ("ADCCON3") __attribute__((section("sfrs"), address(0xBF887020)));
extern volatile uint32_t        ADCCON3CLR __attribute__((section("sfrs"),address(0xBF887024)));
extern volatile uint32_t        ADCCON3SET __attribute__((section("sfrs"),address(0xBF887028)));
extern volatile uint32_t        ADCCON3INV __attribute__((section("sfrs"),address(0xBF88702C)));
#define ADCTRGMODE ADCTRGMODE
extern volatile uint32_t   ADCTRGMODE __attribute__((section("sfrs"), address(0xBF887030)));
typedef struct {
  uint32_t SSAMPEN0:1;
  uint32_t SSAMPEN1:1;
  uint32_t :6;
  uint32_t STRGEN0:1;
  uint32_t STRGEN1:1;
  uint32_t :6;
  uint32_t SH0ALT:2;
  uint32_t SH1ALT:2;
} __ADCTRGMODEbits_t;
extern volatile __ADCTRGMODEbits_t ADCTRGMODEbits __asm__ ("ADCTRGMODE") __attribute__((section("sfrs"), address(0xBF887030)));
extern volatile uint32_t        ADCTRGMODECLR __attribute__((section("sfrs"),address(0xBF887034)));
extern volatile uint32_t        ADCTRGMODESET __attribute__((section("sfrs"),address(0xBF887038)));
extern volatile uint32_t        ADCTRGMODEINV __attribute__((section("sfrs"),address(0xBF88703C)));
#define ADCIMCON1 ADCIMCON1
extern volatile uint32_t   ADCIMCON1 __attribute__((section("sfrs"), address(0xBF887040)));
typedef struct {
  uint32_t SIGN0:1;
  uint32_t DIFF0:1;
  uint32_t SIGN1:1;
  uint32_t DIFF1:1;
  uint32_t SIGN2:1;
  uint32_t DIFF2:1;
  uint32_t SIGN3:1;
  uint32_t DIFF3:1;
  uint32_t SIGN4:1;
  uint32_t DIFF4:1;
  uint32_t SIGN5:1;
  uint32_t DIFF5:1;
  uint32_t :14;
  uint32_t SIGN13:1;
  uint32_t DIFF13:1;
  uint32_t :2;
  uint32_t SIGN15:1;
  uint32_t DIFF15:1;
} __ADCIMCON1bits_t;
