Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
  .extern ADCDATA16INV     /* 0xBF88770C */
  .extern ADCDATA17        /* 0xBF887710 */
  .extern ADCDATA17CLR     /* 0xBF887714 */
  .extern ADCDATA17SET     /* 0xBF887718 */
  .extern ADCDATA17INV     /* 0xBF88771C */
  .extern ADCDATA50        /* 0xBF887920 */
  .extern ADCDATA50CLR     /* 0xBF887924 */
  .extern ADCDATA50SET     /* 0xBF887928 */
  .extern ADCDATA50INV     /* 0xBF88792C */
  .extern ADCDATA53        /* 0xBF887950 */
  .extern ADCDATA53CLR     /* 0xBF887954 */
  .extern ADCDATA53SET     /* 0xBF887958 */
  .extern ADCDATA53INV     /* 0xBF88795C */
  .extern ADC0CFG          /* 0xBF887D00 */
  .extern ADC0CFGCLR       /* 0xBF887D04 */
  .extern ADC0CFGSET       /* 0xBF887D08 */
  .extern ADC0CFGINV       /* 0xBF887D0C */
  .extern ADC1CFG          /* 0xBF887D10 */
  .extern ADC1CFGCLR       /* 0xBF887D14 */
  .extern ADC1CFGSET       /* 0xBF887D18 */
  .extern ADC1CFGINV       /* 0xBF887D1C */
  .extern ADC7CFG          /* 0xBF887D70 */
  .extern ADC7CFGCLR       /* 0xBF887D74 */
  .extern ADC7CFGSET       /* 0xBF887D78 */
  .extern ADC7CFGINV       /* 0xBF887D7C */
  .extern ADCSYSCFG0       /* 0xBF887E00 */
  .extern ADCSYSCFG0CLR    /* 0xBF887E04 */
  .extern ADCSYSCFG0SET    /* 0xBF887E08 */
  .extern ADCSYSCFG0INV    /* 0xBF887E0C */
  .extern ADCSYSCFG1       /* 0xBF887E10 */
  .extern ADCSYSCFG1CLR    /* 0xBF887E14 */
  .extern ADCSYSCFG1SET    /* 0xBF887E18 */
  .extern ADCSYSCFG1INV    /* 0xBF887E1C */
  .extern RTCCON           /* 0xBF8C0000 */
  .extern RTCCONSET        /* 0xBF8C0008 */
  .extern RTCCONINV        /* 0xBF8C000C */
  .extern RTCALRM          /* 0xBF8C0010 */
  .extern RTCALRMCLR       /* 0xBF8C0014 */
  .extern RTCALRMSET       /* 0xBF8C0018 */
  .extern RTCALRMINV       /* 0xBF8C001C */
  .extern RTCTIME          /* 0xBF8C0020 */
  .extern RTCTIMECLR       /* 0xBF8C0024 */
  .extern RTCTIMESET       /* 0xBF8C0028 */
  .extern RTCTIMEINV       /* 0xBF8C002C */
  .extern RTCDATE          /* 0xBF8C0030 */
  .extern RTCDATECLR       /* 0xBF8C0034 */
  .extern RTCDATESET       /* 0xBF8C0038 */
  .extern RTCDATEINV       /* 0xBF8C003C */
  .extern ALRMTIME         /* 0xBF8C0040 */
  .extern ALRMTIMECLR      /* 0xBF8C0044 */
  .extern ALRMTIMESET      /* 0xBF8C0048 */
  .extern ALRMTIMEINV      /* 0xBF8C004C */
  .extern ALRMDATE         /* 0xBF8C0050 */
  .extern ALRMDATECLR      /* 0xBF8C0054 */
  .extern ALRMDATESET      /* 0xBF8C0058 */
  .extern ALRMDATEINV      /* 0xBF8C005C */
  .extern SBFLAG           /* 0xBF8F0510 */
  .extern SBT0ELOG1        /* 0xBF8F8020 */
  .extern SBT0ELOG2        /* 0xBF8F8024 */
  .extern SBT0ECON         /* 0xBF8F8028 */
  .extern SBT0ECLRS        /* 0xBF8F8030 */
  .extern SBT0ECLRM        /* 0xBF8F8038 */
  .extern SBT0REG0         /* 0xBF8F8040 */
  .extern SBT0RD0          /* 0xBF8F8050 */
  .extern SBT0WR0          /* 0xBF8F8058 */
  .extern SBT0REG1         /* 0xBF8F8060 */
  .extern SBT0RD1          /* 0xBF8F8070 */
  .extern SBT0WR1          /* 0xBF8F8078 */
  .extern SBT1ELOG1        /* 0xBF8F8420 */
  .extern SBT1ELOG2        /* 0xBF8F8424 */
  .extern SBT1ECON         /* 0xBF8F8428 */
  .extern SBT1ECLRS        /* 0xBF8F8430 */
  .extern SBT1ECLRM        /* 0xBF8F8438 */
  .extern SBT1REG0         /* 0xBF8F8440 */
  .extern SBT1RD0          /* 0xBF8F8450 */
  .extern SBT1WR0          /* 0xBF8F8458 */
  .extern SBT1REG2         /* 0xBF8F8480 */
  .extern SBT1RD2          /* 0xBF8F8490 */
  .extern SBT1WR2          /* 0xBF8F8498 */
  .extern SBT1REG3         /* 0xBF8F84A0 */
  .extern SBT1RD3          /* 0xBF8F84B0 */
  .extern SBT1WR3          /* 0xBF8F84B8 */
  .extern SBT1REG4         /* 0xBF8F84C0 */
  .extern SBT1RD4          /* 0xBF8F84D0 */
  .extern SBT1WR4          /* 0xBF8F84D8 */
  .extern SBT1REG5         /* 0xBF8F84E0 */
  .extern SBT1RD5          /* 0xBF8F84F0 */
  .extern SBT1WR5          /* 0xBF8F84F8 */
  .extern SBT1REG6         /* 0xBF8F8500 */
  .extern SBT1RD6          /* 0xBF8F8510 */
  .extern SBT1WR6          /* 0xBF8F8518 */
  .extern SBT1REG7         /* 0xBF8F8520 */
  .extern SBT1RD7          /* 0xBF8F8530 */
  .extern SBT1WR7          /* 0xBF8F8538 */
  .extern SBT1REG8         /* 0xBF8F8540 */
  .extern SBT1RD8          /* 0xBF8F8550 */
  .extern SBT1WR8          /* 0xBF8F8558 */
  .extern SBT2ELOG1        /* 0xBF8F8820 */
  .extern SBT2ELOG2        /* 0xBF8F8824 */
  .extern SBT2ECON         /* 0xBF8F8828 */
  .extern SBT2ECLRS        /* 0xBF8F8830 */
  .extern SBT2ECLRM        /* 0xBF8F8838 */
  .extern SBT2REG0         /* 0xBF8F8840 */
  .extern SBT2RD0          /* 0xBF8F8850 */
  .extern SBT2WR0          /* 0xBF8F8858 */
  .extern SBT2REG1         /* 0xBF8F8860 */
  .extern SBT2RD1          /* 0xBF8F8870 */
  .extern SBT2WR1          /* 0xBF8F8878 */
  .extern SBT2REG2         /* 0xBF8F8880 */
  .extern SBT2RD2          /* 0xBF8F8890 */
  .extern SBT2WR2          /* 0xBF8F8898 */
  .extern SBT3ELOG1        /* 0xBF8F8C20 */
  .extern SBT3ELOG2        /* 0xBF8F8C24 */
  .extern SBT3ECON         /* 0xBF8F8C28 */
  .extern SBT3ECLRS        /* 0xBF8F8C30 */
  .extern SBT3ECLRM        /* 0xBF8F8C38 */
  .extern SBT3REG0         /* 0xBF8F8C40 */
  .extern SBT3RD0          /* 0xBF8F8C50 */
  .extern SBT3WR0          /* 0xBF8F8C58 */
  .extern SBT3REG1         /* 0xBF8F8C60 */
  .extern SBT3RD1          /* 0xBF8F8C70 */
  .extern SBT3WR1          /* 0xBF8F8C78 */
  .extern SBT3REG2         /* 0xBF8F8C80 */
  .extern SBT3RD2          /* 0xBF8F8C90 */
  .extern SBT3WR2          /* 0xBF8F8C98 */
  .extern DEVCFG3          /* 0xBFC03FC0 */
  .extern DEVCFG2          /* 0xBFC03FC4 */
  .extern DEVCFG1          /* 0xBFC03FC8 */
  .extern DEVCFG0          /* 0xBFC03FCC */
  .extern DEVCP            /* 0xBFC03FDC */
  .extern DEVSIGN          /* 0xBFC03FEC */
  .extern SEQ              /* 0xBFC03FF0 */
  .extern DEVADC0          /* 0xBFC45000 */
  .extern DEVADC1          /* 0xBFC45004 */
  .extern DEVADC7          /* 0xBFC45018 */
  .extern DEVSN0           /* 0xBFC45020 */
  .extern DEVSN1           /* 0xBFC45024 */
  .extern DEVSN2           /* 0xBFC45028 */
  .extern DEVSN3           /* 0xBFC4502C */
  .extern ADEVCFG3         /* 0xBFC03F40 */
  .extern ADEVCFG2         /* 0xBFC03F44 */
  .extern ADEVCFG1         /* 0xBFC03F48 */
  .extern ADEVCFG0         /* 0xBFC03F4C */
  .extern ADEVCP           /* 0xBFC03F5C */
  .extern ADEVSIGN         /* 0xBFC03F6C */
  .extern ASEQ             /* 0xBFC03F70 */
  .extern ABF1DEVCFG3      /* 0xBFC43F40 */
  .extern ABF1DEVCFG2      /* 0xBFC43F44 */
  .extern ABF1DEVCFG1      /* 0xBFC43F48 */
  .extern ABF1DEVCFG0      /* 0xBFC43F4C */
  .extern ABF1DEVCP        /* 0xBFC43F5C */
  .extern ABF1DEVSIGN      /* 0xBFC43F6C */
  .extern ABF1SEQ          /* 0xBFC43F70 */
  .extern BF1DEVCFG3       /* 0xBFC43FC0 */
  .extern BF1DEVCFG2       /* 0xBFC43FC4 */
  .extern BF1DEVCFG1       /* 0xBFC43FC8 */
  .extern BF1DEVCFG0       /* 0xBFC43FCC */
  .extern BF1DEVCP         /* 0xBFC43FDC */
  .extern BF1DEVSIGN       /* 0xBFC43FEC */
  .extern BF1SEQ           /* 0xBFC43FF0 */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_ECCCON_POSITION                  0x00000004
#define _CFGCON_ECCCON_MASK                      0x00000030
#define _CFGCON_ECCCON_LENGTH                    0x00000002

#define _CFGCON_IOANCPEN_POSITION                0x00000007
#define _CFGCON_IOANCPEN_MASK                    0x00000080
#define _CFGCON_IOANCPEN_LENGTH                  0x00000001

