Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _HOME1R_HOME1R_POSITION                  0x00000000
#define _HOME1R_HOME1R_MASK                      0x0000000F
#define _HOME1R_HOME1R_LENGTH                    0x00000004

#define _QEA2R_QEA2R_POSITION                    0x00000000
#define _QEA2R_QEA2R_MASK                        0x0000000F
#define _QEA2R_QEA2R_LENGTH                      0x00000004

#define _QEB2R_QEB2R_POSITION                    0x00000000
#define _QEB2R_QEB2R_MASK                        0x0000000F
#define _QEB2R_QEB2R_LENGTH                      0x00000004

#define _INDX2R_INDX2R_POSITION                  0x00000000
#define _INDX2R_INDX2R_MASK                      0x0000000F
#define _INDX2R_INDX2R_LENGTH                    0x00000004

#define _HOME2R_HOME2R_POSITION                  0x00000000
#define _HOME2R_HOME2R_MASK                      0x0000000F
#define _HOME2R_HOME2R_LENGTH                    0x00000004

#define _FLT1R_FLT1R_POSITION                    0x00000000
#define _FLT1R_FLT1R_MASK                        0x0000000F
#define _FLT1R_FLT1R_LENGTH                      0x00000004

#define _FLT2R_FLT2R_POSITION                    0x00000000
#define _FLT2R_FLT2R_MASK                        0x0000000F
#define _FLT2R_FLT2R_LENGTH                      0x00000004

#define _CLCINAR_CLCINAR_POSITION                0x00000000
#define _CLCINAR_CLCINAR_MASK                    0x0000000F
#define _CLCINAR_CLCINAR_LENGTH                  0x00000004

#define _CLCINBR_CLCINBR_POSITION                0x00000000
#define _CLCINBR_CLCINBR_MASK                    0x0000000F
#define _CLCINBR_CLCINBR_LENGTH                  0x00000004

#define _CLCINCR_CLCINCR_POSITION                0x00000000
#define _CLCINCR_CLCINCR_MASK                    0x0000000F
#define _CLCINCR_CLCINCR_LENGTH                  0x00000004

#define _CLCINDR_CLCINDR_POSITION                0x00000000
#define _CLCINDR_CLCINDR_MASK                    0x0000000F
#define _CLCINDR_CLCINDR_LENGTH                  0x00000004

#define _RPA0R_RPA0R_POSITION                    0x00000000
#define _RPA0R_RPA0R_MASK                        0x0000001F
#define _RPA0R_RPA0R_LENGTH                      0x00000005

#define _RPA1R_RPA1R_POSITION                    0x00000000
#define _RPA1R_RPA1R_MASK                        0x0000001F
#define _RPA1R_RPA1R_LENGTH                      0x00000005

#define _RPA2R_RPA2R_POSITION                    0x00000000
#define _RPA2R_RPA2R_MASK                        0x0000001F
#define _RPA2R_RPA2R_LENGTH                      0x00000005

#define _RPA3R_RPA3R_POSITION                    0x00000000
#define _RPA3R_RPA3R_MASK                        0x0000001F
#define _RPA3R_RPA3R_LENGTH                      0x00000005

#define _RPA4R_RPA4R_POSITION                    0x00000000
#define _RPA4R_RPA4R_MASK                        0x0000001F
#define _RPA4R_RPA4R_LENGTH                      0x00000005

#define _RPA7R_RPA7R_POSITION                    0x00000000
#define _RPA7R_RPA7R_MASK                        0x0000001F
#define _RPA7R_RPA7R_LENGTH                      0x00000005

#define _RPA8R_RPA8R_POSITION                    0x00000000
#define _RPA8R_RPA8R_MASK                        0x0000001F
#define _RPA8R_RPA8R_LENGTH                      0x00000005

#define _RPA11R_RPA11R_POSITION                  0x00000000
#define _RPA11R_RPA11R_MASK                      0x0000001F
#define _RPA11R_RPA11R_LENGTH                    0x00000005

#define _RPA12R_RPA12R_POSITION                  0x00000000
#define _RPA12R_RPA12R_MASK                      0x0000001F
#define _RPA12R_RPA12R_LENGTH                    0x00000005

#define _RPB0R_RPB0R_POSITION                    0x00000000
#define _RPB0R_RPB0R_MASK                        0x0000001F
#define _RPB0R_RPB0R_LENGTH                      0x00000005

#define _RPB1R_RPB1R_POSITION                    0x00000000
#define _RPB1R_RPB1R_MASK                        0x0000001F
#define _RPB1R_RPB1R_LENGTH                      0x00000005

#define _RPB2R_RPB2R_POSITION                    0x00000000
#define _RPB2R_RPB2R_MASK                        0x0000001F
#define _RPB2R_RPB2R_LENGTH                      0x00000005

#define _RPB3R_RPB3R_POSITION                    0x00000000
#define _RPB3R_RPB3R_MASK                        0x0000001F
#define _RPB3R_RPB3R_LENGTH                      0x00000005

#define _RPB4R_RPB4R_POSITION                    0x00000000
#define _RPB4R_RPB4R_MASK                        0x0000001F
#define _RPB4R_RPB4R_LENGTH                      0x00000005

#define _RPB5R_RPB5R_POSITION                    0x00000000
#define _RPB5R_RPB5R_MASK                        0x0000001F
#define _RPB5R_RPB5R_LENGTH                      0x00000005

#define _RPB6R_RPB6R_POSITION                    0x00000000
#define _RPB6R_RPB6R_MASK                        0x0000001F
#define _RPB6R_RPB6R_LENGTH                      0x00000005

#define _RPB7R_RPB7R_POSITION                    0x00000000
#define _RPB7R_RPB7R_MASK                        0x0000001F
#define _RPB7R_RPB7R_LENGTH                      0x00000005

#define _RPB9R_RPB9R_POSITION                    0x00000000
#define _RPB9R_RPB9R_MASK                        0x0000001F
#define _RPB9R_RPB9R_LENGTH                      0x00000005

#define _RPB10R_RPB10R_POSITION                  0x00000000
#define _RPB10R_RPB10R_MASK                      0x0000001F
#define _RPB10R_RPB10R_LENGTH                    0x00000005

#define _RPB11R_RPB11R_POSITION                  0x00000000
#define _RPB11R_RPB11R_MASK                      0x0000001F
#define _RPB11R_RPB11R_LENGTH                    0x00000005

#define _RPB12R_RPB12R_POSITION                  0x00000000
#define _RPB12R_RPB12R_MASK                      0x0000001F
#define _RPB12R_RPB12R_LENGTH                    0x00000005

#define _RPB13R_RPB13R_POSITION                  0x00000000
#define _RPB13R_RPB13R_MASK                      0x0000001F
#define _RPB13R_RPB13R_LENGTH                    0x00000005

#define _RPB14R_RPB14R_POSITION                  0x00000000
#define _RPB14R_RPB14R_MASK                      0x0000001F
#define _RPB14R_RPB14R_LENGTH                    0x00000005

#define _RPB15R_RPB15R_POSITION                  0x00000000
#define _RPB15R_RPB15R_MASK                      0x0000001F
#define _RPB15R_RPB15R_LENGTH                    0x00000005

#define _RPC0R_RPC0R_POSITION                    0x00000000
#define _RPC0R_RPC0R_MASK                        0x0000001F
#define _RPC0R_RPC0R_LENGTH                      0x00000005

#define _RPC1R_RPC1R_POSITION                    0x00000000
#define _RPC1R_RPC1R_MASK                        0x0000001F
#define _RPC1R_RPC1R_LENGTH                      0x00000005

