Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _IFS3_AD1D5IF_POSITION                   0x0000000F
#define _IFS3_AD1D5IF_MASK                       0x00008000
#define _IFS3_AD1D5IF_LENGTH                     0x00000001

#define _IFS3_AD1D13IF_POSITION                  0x00000017
#define _IFS3_AD1D13IF_MASK                      0x00800000
#define _IFS3_AD1D13IF_LENGTH                    0x00000001

#define _IFS3_AD1D15IF_POSITION                  0x00000019
#define _IFS3_AD1D15IF_MASK                      0x02000000
#define _IFS3_AD1D15IF_LENGTH                    0x00000001

#define _IFS3_AD1D16IF_POSITION                  0x0000001A
#define _IFS3_AD1D16IF_MASK                      0x04000000
#define _IFS3_AD1D16IF_LENGTH                    0x00000001

#define _IFS3_AD1D17IF_POSITION                  0x0000001B
#define _IFS3_AD1D17IF_MASK                      0x08000000
#define _IFS3_AD1D17IF_LENGTH                    0x00000001

#define _IFS3_w_POSITION                         0x00000000
#define _IFS3_w_MASK                             0xFFFFFFFF
#define _IFS3_w_LENGTH                           0x00000020

#define _IFS4_AD1D50IF_POSITION                  0x0000001C
#define _IFS4_AD1D50IF_MASK                      0x10000000
#define _IFS4_AD1D50IF_LENGTH                    0x00000001

#define _IFS4_AD1D53IF_POSITION                  0x0000001F
#define _IFS4_AD1D53IF_MASK                      0x80000000
#define _IFS4_AD1D53IF_LENGTH                    0x00000001

#define _IFS4_w_POSITION                         0x00000000
#define _IFS4_w_MASK                             0xFFFFFFFF
#define _IFS4_w_LENGTH                           0x00000020

#define _IFS5_QEI1IF_POSITION                    0x00000009
#define _IFS5_QEI1IF_MASK                        0x00000200
#define _IFS5_QEI1IF_LENGTH                      0x00000001

#define _IFS5_QEI2IF_POSITION                    0x0000000A
#define _IFS5_QEI2IF_MASK                        0x00000400
#define _IFS5_QEI2IF_LENGTH                      0x00000001

#define _IFS5_PWMPEVTIF_POSITION                 0x0000000B
#define _IFS5_PWMPEVTIF_MASK                     0x00000800
#define _IFS5_PWMPEVTIF_LENGTH                   0x00000001

#define _IFS5_PWMSEVTIF_POSITION                 0x0000000C
#define _IFS5_PWMSEVTIF_MASK                     0x00001000
#define _IFS5_PWMSEVTIF_LENGTH                   0x00000001

#define _IFS5_PWM1IF_POSITION                    0x0000000D
#define _IFS5_PWM1IF_MASK                        0x00002000
#define _IFS5_PWM1IF_LENGTH                      0x00000001

#define _IFS5_PWM2IF_POSITION                    0x0000000E
#define _IFS5_PWM2IF_MASK                        0x00004000
#define _IFS5_PWM2IF_LENGTH                      0x00000001

#define _IFS5_PWM3IF_POSITION                    0x0000000F
#define _IFS5_PWM3IF_MASK                        0x00008000
#define _IFS5_PWM3IF_LENGTH                      0x00000001

#define _IFS5_PWM4IF_POSITION                    0x00000010
#define _IFS5_PWM4IF_MASK                        0x00010000
#define _IFS5_PWM4IF_LENGTH                      0x00000001

#define _IFS5_DMA4IF_POSITION                    0x00000016
#define _IFS5_DMA4IF_MASK                        0x00400000
#define _IFS5_DMA4IF_LENGTH                      0x00000001

#define _IFS5_DMA5IF_POSITION                    0x00000017
#define _IFS5_DMA5IF_MASK                        0x00800000
#define _IFS5_DMA5IF_LENGTH                      0x00000001

#define _IFS5_DMA6IF_POSITION                    0x00000018
#define _IFS5_DMA6IF_MASK                        0x01000000
#define _IFS5_DMA6IF_LENGTH                      0x00000001

#define _IFS5_DMA7IF_POSITION                    0x00000019
#define _IFS5_DMA7IF_MASK                        0x02000000
#define _IFS5_DMA7IF_LENGTH                      0x00000001

#define _IFS5_w_POSITION                         0x00000000
#define _IFS5_w_MASK                             0xFFFFFFFF
#define _IFS5_w_LENGTH                           0x00000020

#define _IFS7_SBIF_POSITION                      0x00000006
#define _IFS7_SBIF_MASK                          0x00000040
#define _IFS7_SBIF_LENGTH                        0x00000001

#define _IFS7_PCACHEIF_POSITION                  0x00000017
#define _IFS7_PCACHEIF_MASK                      0x00800000
#define _IFS7_PCACHEIF_LENGTH                    0x00000001

#define _IFS7_CLC1IF_POSITION                    0x00000019
#define _IFS7_CLC1IF_MASK                        0x02000000
#define _IFS7_CLC1IF_LENGTH                      0x00000001

#define _IFS7_CPCIF_POSITION                     0x0000001E
#define _IFS7_CPCIF_MASK                         0x40000000
#define _IFS7_CPCIF_LENGTH                       0x00000001

#define _IFS7_CPDIF_POSITION                     0x0000001F
#define _IFS7_CPDIF_MASK                         0x80000000
#define _IFS7_CPDIF_LENGTH                       0x00000001

#define _IFS7_w_POSITION                         0x00000000
#define _IFS7_w_MASK                             0xFFFFFFFF
#define _IFS7_w_LENGTH                           0x00000020

#define _IEC0_CTIE_POSITION                      0x00000000
#define _IEC0_CTIE_MASK                          0x00000001
#define _IEC0_CTIE_LENGTH                        0x00000001

#define _IEC0_CS0IE_POSITION                     0x00000001
#define _IEC0_CS0IE_MASK                         0x00000002
#define _IEC0_CS0IE_LENGTH                       0x00000001

#define _IEC0_CS1IE_POSITION                     0x00000002
#define _IEC0_CS1IE_MASK                         0x00000004
#define _IEC0_CS1IE_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000003
#define _IEC0_INT0IE_MASK                        0x00000008
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_T1IE_POSITION                      0x00000004
#define _IEC0_T1IE_MASK                          0x00000010
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_IC1EIE_POSITION                    0x00000005
#define _IEC0_IC1EIE_MASK                        0x00000020
#define _IEC0_IC1EIE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000006
#define _IEC0_IC1IE_MASK                         0x00000040
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000007
#define _IEC0_OC1IE_MASK                         0x00000080
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_INT1IE_POSITION                    0x00000008
#define _IEC0_INT1IE_MASK                        0x00000100
#define _IEC0_INT1IE_LENGTH                      0x00000001

#define _IEC0_T2IE_POSITION                      0x00000009
#define _IEC0_T2IE_MASK                          0x00000200
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_IC2EIE_POSITION                    0x0000000A
#define _IEC0_IC2EIE_MASK                        0x00000400
#define _IEC0_IC2EIE_LENGTH                      0x00000001

#define _IEC0_IC2IE_POSITION                     0x0000000B
#define _IEC0_IC2IE_MASK                         0x00000800
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x0000000C
#define _IEC0_OC2IE_MASK                         0x00001000
#define _IEC0_OC2IE_LENGTH                       0x00000001

#define _IEC0_INT2IE_POSITION                    0x0000000D
#define _IEC0_INT2IE_MASK                        0x00002000
#define _IEC0_INT2IE_LENGTH                      0x00000001

#define _IEC0_T3IE_POSITION                      0x0000000E
#define _IEC0_T3IE_MASK                          0x00004000
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_IC3EIE_POSITION                    0x0000000F
#define _IEC0_IC3EIE_MASK                        0x00008000
#define _IEC0_IC3EIE_LENGTH                      0x00000001

#define _IEC0_IC3IE_POSITION                     0x00000010
#define _IEC0_IC3IE_MASK                         0x00010000
#define _IEC0_IC3IE_LENGTH                       0x00000001

#define _IEC0_OC3IE_POSITION                     0x00000011
#define _IEC0_OC3IE_MASK                         0x00020000
#define _IEC0_OC3IE_LENGTH                       0x00000001

