Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _QEI2STAT_HOMIEN_POSITION                0x00000002
#define _QEI2STAT_HOMIEN_MASK                    0x00000004
#define _QEI2STAT_HOMIEN_LENGTH                  0x00000001

#define _QEI2STAT_HOMIRQ_POSITION                0x00000003
#define _QEI2STAT_HOMIRQ_MASK                    0x00000008
#define _QEI2STAT_HOMIRQ_LENGTH                  0x00000001

#define _QEI2STAT_VELOVIEN_POSITION              0x00000004
#define _QEI2STAT_VELOVIEN_MASK                  0x00000010
#define _QEI2STAT_VELOVIEN_LENGTH                0x00000001

#define _QEI2STAT_VELOVIRQ_POSITION              0x00000005
#define _QEI2STAT_VELOVIRQ_MASK                  0x00000020
#define _QEI2STAT_VELOVIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCIIEN_POSITION                0x00000006
#define _QEI2STAT_PCIIEN_MASK                    0x00000040
#define _QEI2STAT_PCIIEN_LENGTH                  0x00000001

#define _QEI2STAT_PCIIRQ_POSITION                0x00000007
#define _QEI2STAT_PCIIRQ_MASK                    0x00000080
#define _QEI2STAT_PCIIRQ_LENGTH                  0x00000001

#define _QEI2STAT_POSOVIEN_POSITION              0x00000008
#define _QEI2STAT_POSOVIEN_MASK                  0x00000100
#define _QEI2STAT_POSOVIEN_LENGTH                0x00000001

#define _QEI2STAT_POSOVIRQ_POSITION              0x00000009
#define _QEI2STAT_POSOVIRQ_MASK                  0x00000200
#define _QEI2STAT_POSOVIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCLEQIEN_POSITION              0x0000000A
#define _QEI2STAT_PCLEQIEN_MASK                  0x00000400
#define _QEI2STAT_PCLEQIEN_LENGTH                0x00000001

#define _QEI2STAT_PCLEQIRQ_POSITION              0x0000000B
#define _QEI2STAT_PCLEQIRQ_MASK                  0x00000800
#define _QEI2STAT_PCLEQIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCHEQIEN_POSITION              0x0000000C
#define _QEI2STAT_PCHEQIEN_MASK                  0x00001000
#define _QEI2STAT_PCHEQIEN_LENGTH                0x00000001

#define _QEI2STAT_PCHEQIRQ_POSITION              0x0000000D
#define _QEI2STAT_PCHEQIRQ_MASK                  0x00002000
#define _QEI2STAT_PCHEQIRQ_LENGTH                0x00000001

#define _POS2CNT_POSCNT_POSITION                 0x00000000
#define _POS2CNT_POSCNT_MASK                     0xFFFFFFFF
#define _POS2CNT_POSCNT_LENGTH                   0x00000020

#define _POS2HLD_POSHLD_POSITION                 0x00000000
#define _POS2HLD_POSHLD_MASK                     0xFFFFFFFF
#define _POS2HLD_POSHLD_LENGTH                   0x00000020

#define _VEL2CNT_VELCNT_POSITION                 0x00000000
#define _VEL2CNT_VELCNT_MASK                     0xFFFFFFFF
#define _VEL2CNT_VELCNT_LENGTH                   0x00000020

#define _VEL2HLD_VELHLD_POSITION                 0x00000000
#define _VEL2HLD_VELHLD_MASK                     0xFFFFFFFF
#define _VEL2HLD_VELHLD_LENGTH                   0x00000020

#define _INT2TMR_INTTMR_POSITION                 0x00000000
#define _INT2TMR_INTTMR_MASK                     0xFFFFFFFF
#define _INT2TMR_INTTMR_LENGTH                   0x00000020

#define _INT2HLD_INTHLD_POSITION                 0x00000000
#define _INT2HLD_INTHLD_MASK                     0xFFFFFFFF
#define _INT2HLD_INTHLD_LENGTH                   0x00000020

#define _INDX2CNT_INDXCNT_POSITION               0x00000000
#define _INDX2CNT_INDXCNT_MASK                   0xFFFFFFFF
#define _INDX2CNT_INDXCNT_LENGTH                 0x00000020

#define _INDX2HLD_INDXHLD_POSITION               0x00000000
#define _INDX2HLD_INDXHLD_MASK                   0xFFFFFFFF
#define _INDX2HLD_INDXHLD_LENGTH                 0x00000020

#define _QEI2ICC_QEIICC_POSITION                 0x00000000
#define _QEI2ICC_QEIICC_MASK                     0xFFFFFFFF
#define _QEI2ICC_QEIICC_LENGTH                   0x00000020

#define _QEI2CMPL_QEICMPL_POSITION               0x00000000
#define _QEI2CMPL_QEICMPL_MASK                   0xFFFFFFFF
#define _QEI2CMPL_QEICMPL_LENGTH                 0x00000020

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_C3OUT_POSITION                   0x00000002
#define _CMSTAT_C3OUT_MASK                       0x00000004
#define _CMSTAT_C3OUT_LENGTH                     0x00000001

#define _CMSTAT_C4OUT_POSITION                   0x00000003
#define _CMSTAT_C4OUT_MASK                       0x00000008
#define _CMSTAT_C4OUT_LENGTH                     0x00000001

#define _CMSTAT_C5OUT_POSITION                   0x00000004
#define _CMSTAT_C5OUT_MASK                       0x00000010
#define _CMSTAT_C5OUT_LENGTH                     0x00000001

#define _CMSTAT_SIDL_POSITION                    0x0000000D
#define _CMSTAT_SIDL_MASK                        0x00002000
#define _CMSTAT_SIDL_LENGTH                      0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000010
#define _CMSTAT_C1EVT_MASK                       0x00010000
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000011
#define _CMSTAT_C2EVT_MASK                       0x00020000
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CMSTAT_C3EVT_POSITION                   0x00000012
#define _CMSTAT_C3EVT_MASK                       0x00040000
#define _CMSTAT_C3EVT_LENGTH                     0x00000001

#define _CMSTAT_C4EVT_POSITION                   0x00000013
#define _CMSTAT_C4EVT_MASK                       0x00080000
#define _CMSTAT_C4EVT_LENGTH                     0x00000001

#define _CMSTAT_C5EVT_POSITION                   0x00000014
#define _CMSTAT_C5EVT_MASK                       0x00100000
#define _CMSTAT_C5EVT_LENGTH                     0x00000001

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000010
#define _CM1CON_CREF_LENGTH                      0x00000001

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CEVT_POSITION                    0x00000009
#define _CM1CON_CEVT_MASK                        0x00000200
#define _CM1CON_CEVT_LENGTH                      0x00000001

