Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _CNENC_w_POSITION                        0x00000000
#define _CNENC_w_MASK                            0xFFFFFFFF
#define _CNENC_w_LENGTH                          0x00000020

#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
#define _CNSTATC_CNSTATC12_MASK                  0x00001000
#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

#define _CNSTATC_CNSTATC15_POSITION              0x0000000F
#define _CNSTATC_CNSTATC15_MASK                  0x00008000
#define _CNSTATC_CNSTATC15_LENGTH                0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _CNNEC_CNNEC12_POSITION                  0x0000000C
#define _CNNEC_CNNEC12_MASK                      0x00001000
#define _CNNEC_CNNEC12_LENGTH                    0x00000001

#define _CNNEC_CNNEC15_POSITION                  0x0000000F
#define _CNNEC_CNNEC15_MASK                      0x00008000
#define _CNNEC_CNNEC15_LENGTH                    0x00000001

#define _CNFC_CNFC12_POSITION                    0x0000000C
#define _CNFC_CNFC12_MASK                        0x00001000
#define _CNFC_CNFC12_LENGTH                      0x00000001

#define _CNFC_CNFC15_POSITION                    0x0000000F
#define _CNFC_CNFC15_MASK                        0x00008000
#define _CNFC_CNFC15_LENGTH                      0x00000001

#define _SRCON0C_SR0C15_POSITION                 0x0000000F
#define _SRCON0C_SR0C15_MASK                     0x00008000
#define _SRCON0C_SR0C15_LENGTH                   0x00000001

#define _SRCON1C_SR1C15_POSITION                 0x0000000F
#define _SRCON1C_SR1C15_MASK                     0x00008000
#define _SRCON1C_SR1C15_LENGTH                   0x00000001

#define _ANSELD_w_POSITION                       0x00000000
#define _ANSELD_w_MASK                           0xFFFFFFFF
#define _ANSELD_w_LENGTH                         0x00000020

#define _TRISD_w_POSITION                        0x00000000
#define _TRISD_w_MASK                            0xFFFFFFFF
#define _TRISD_w_LENGTH                          0x00000020

#define _PORTD_w_POSITION                        0x00000000
#define _PORTD_w_MASK                            0xFFFFFFFF
#define _PORTD_w_LENGTH                          0x00000020

#define _LATD_w_POSITION                         0x00000000
#define _LATD_w_MASK                             0xFFFFFFFF
#define _LATD_w_LENGTH                           0x00000020

#define _ODCD_w_POSITION                         0x00000000
#define _ODCD_w_MASK                             0xFFFFFFFF
#define _ODCD_w_LENGTH                           0x00000020

#define _CNPDD_w_POSITION                        0x00000000
#define _CNPDD_w_MASK                            0xFFFFFFFF
#define _CNPDD_w_LENGTH                          0x00000020

#define _CNCOND_EDGEDETECT_POSITION              0x0000000B
#define _CNCOND_EDGEDETECT_MASK                  0x00000800
#define _CNCOND_EDGEDETECT_LENGTH                0x00000001

#define _CNCOND_ON_POSITION                      0x0000000F
#define _CNCOND_ON_MASK                          0x00008000
#define _CNCOND_ON_LENGTH                        0x00000001

#define _CNCOND_w_POSITION                       0x00000000
#define _CNCOND_w_MASK                           0xFFFFFFFF
#define _CNCOND_w_LENGTH                         0x00000020

#define _CNEND_w_POSITION                        0x00000000
#define _CNEND_w_MASK                            0xFFFFFFFF
#define _CNEND_w_LENGTH                          0x00000020

#define _CNSTATD_w_POSITION                      0x00000000
#define _CNSTATD_w_MASK                          0xFFFFFFFF
#define _CNSTATD_w_LENGTH                        0x00000020

#define _ADCCON1_DMABL_POSITION                  0x00000000
#define _ADCCON1_DMABL_MASK                      0x00000007
#define _ADCCON1_DMABL_LENGTH                    0x00000003

#define _ADCCON1_STRGLVL_POSITION                0x00000003
#define _ADCCON1_STRGLVL_MASK                    0x00000008
#define _ADCCON1_STRGLVL_LENGTH                  0x00000001

#define _ADCCON1_IRQVS_POSITION                  0x00000004
#define _ADCCON1_IRQVS_MASK                      0x00000070
#define _ADCCON1_IRQVS_LENGTH                    0x00000003

#define _ADCCON1_FSPBCLKEN_POSITION              0x00000009
#define _ADCCON1_FSPBCLKEN_MASK                  0x00000200
#define _ADCCON1_FSPBCLKEN_LENGTH                0x00000001

#define _ADCCON1_FSSCLKEN_POSITION               0x0000000A
#define _ADCCON1_FSSCLKEN_MASK                   0x00000400
#define _ADCCON1_FSSCLKEN_LENGTH                 0x00000001

#define _ADCCON1_AICPMPEN_POSITION               0x0000000C
#define _ADCCON1_AICPMPEN_MASK                   0x00001000
#define _ADCCON1_AICPMPEN_LENGTH                 0x00000001

#define _ADCCON1_SIDL_POSITION                   0x0000000D
#define _ADCCON1_SIDL_MASK                       0x00002000
#define _ADCCON1_SIDL_LENGTH                     0x00000001

#define _ADCCON1_ON_POSITION                     0x0000000F
#define _ADCCON1_ON_MASK                         0x00008000
#define _ADCCON1_ON_LENGTH                       0x00000001

#define _ADCCON1_STRGSRC_POSITION                0x00000010
#define _ADCCON1_STRGSRC_MASK                    0x001F0000
#define _ADCCON1_STRGSRC_LENGTH                  0x00000005

#define _ADCCON1_SELRES_POSITION                 0x00000015
#define _ADCCON1_SELRES_MASK                     0x00600000
#define _ADCCON1_SELRES_LENGTH                   0x00000002

#define _ADCCON1_FRACT_POSITION                  0x00000017
#define _ADCCON1_FRACT_MASK                      0x00800000
#define _ADCCON1_FRACT_LENGTH                    0x00000001

#define _ADCCON1_TRBSLV_POSITION                 0x00000018
#define _ADCCON1_TRBSLV_MASK                     0x07000000
#define _ADCCON1_TRBSLV_LENGTH                   0x00000003

#define _ADCCON1_TRBMST_POSITION                 0x0000001B
#define _ADCCON1_TRBMST_MASK                     0x38000000
#define _ADCCON1_TRBMST_LENGTH                   0x00000003

#define _ADCCON1_TRBERR_POSITION                 0x0000001E
#define _ADCCON1_TRBERR_MASK                     0x40000000
#define _ADCCON1_TRBERR_LENGTH                   0x00000001

#define _ADCCON1_TRBEN_POSITION                  0x0000001F
#define _ADCCON1_TRBEN_MASK                      0x80000000
#define _ADCCON1_TRBEN_LENGTH                    0x00000001

#define _ADCCON2_ADCDIV_POSITION                 0x00000000
#define _ADCCON2_ADCDIV_MASK                     0x0000007F
#define _ADCCON2_ADCDIV_LENGTH                   0x00000007

#define _ADCCON2_ADCEIS_POSITION                 0x00000008
#define _ADCCON2_ADCEIS_MASK                     0x00000700
#define _ADCCON2_ADCEIS_LENGTH                   0x00000003

#define _ADCCON2_ADCEIOVR_POSITION               0x0000000C
#define _ADCCON2_ADCEIOVR_MASK                   0x00001000
#define _ADCCON2_ADCEIOVR_LENGTH                 0x00000001

#define _ADCCON2_EOSIEN_POSITION                 0x0000000D
#define _ADCCON2_EOSIEN_MASK                     0x00002000
#define _ADCCON2_EOSIEN_LENGTH                   0x00000001

#define _ADCCON2_REFFLTIEN_POSITION              0x0000000E
#define _ADCCON2_REFFLTIEN_MASK                  0x00004000
#define _ADCCON2_REFFLTIEN_LENGTH                0x00000001

