Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _ADCCON2_BGVRIEN_POSITION                0x0000000F
#define _ADCCON2_BGVRIEN_MASK                    0x00008000
#define _ADCCON2_BGVRIEN_LENGTH                  0x00000001

#define _ADCCON2_SAMC_POSITION                   0x00000010
#define _ADCCON2_SAMC_MASK                       0x03FF0000
#define _ADCCON2_SAMC_LENGTH                     0x0000000A

#define _ADCCON2_EOSRDY_POSITION                 0x0000001D
#define _ADCCON2_EOSRDY_MASK                     0x20000000
#define _ADCCON2_EOSRDY_LENGTH                   0x00000001

#define _ADCCON2_REFFLT_POSITION                 0x0000001E
#define _ADCCON2_REFFLT_MASK                     0x40000000
#define _ADCCON2_REFFLT_LENGTH                   0x00000001

#define _ADCCON2_BGVRRDY_POSITION                0x0000001F
#define _ADCCON2_BGVRRDY_MASK                    0x80000000
#define _ADCCON2_BGVRRDY_LENGTH                  0x00000001

#define _ADCCON3_ADINSEL_POSITION                0x00000000
#define _ADCCON3_ADINSEL_MASK                    0x0000003F
#define _ADCCON3_ADINSEL_LENGTH                  0x00000006

#define _ADCCON3_GSWTRG_POSITION                 0x00000006
#define _ADCCON3_GSWTRG_MASK                     0x00000040
#define _ADCCON3_GSWTRG_LENGTH                   0x00000001

#define _ADCCON3_GLSWTRG_POSITION                0x00000007
#define _ADCCON3_GLSWTRG_MASK                    0x00000080
#define _ADCCON3_GLSWTRG_LENGTH                  0x00000001

#define _ADCCON3_RQCNVRT_POSITION                0x00000008
#define _ADCCON3_RQCNVRT_MASK                    0x00000100
#define _ADCCON3_RQCNVRT_LENGTH                  0x00000001

#define _ADCCON3_SAMP_POSITION                   0x00000009
#define _ADCCON3_SAMP_MASK                       0x00000200
#define _ADCCON3_SAMP_LENGTH                     0x00000001

#define _ADCCON3_UPDRDY_POSITION                 0x0000000A
#define _ADCCON3_UPDRDY_MASK                     0x00000400
#define _ADCCON3_UPDRDY_LENGTH                   0x00000001

#define _ADCCON3_UPDIEN_POSITION                 0x0000000B
#define _ADCCON3_UPDIEN_MASK                     0x00000800
#define _ADCCON3_UPDIEN_LENGTH                   0x00000001

#define _ADCCON3_TRGSUSP_POSITION                0x0000000C
#define _ADCCON3_TRGSUSP_MASK                    0x00001000
#define _ADCCON3_TRGSUSP_LENGTH                  0x00000001

#define _ADCCON3_VREFSEL_POSITION                0x0000000D
#define _ADCCON3_VREFSEL_MASK                    0x0000E000
#define _ADCCON3_VREFSEL_LENGTH                  0x00000003

#define _ADCCON3_DIGEN0_POSITION                 0x00000010
#define _ADCCON3_DIGEN0_MASK                     0x00010000
#define _ADCCON3_DIGEN0_LENGTH                   0x00000001

#define _ADCCON3_DIGEN1_POSITION                 0x00000011
#define _ADCCON3_DIGEN1_MASK                     0x00020000
#define _ADCCON3_DIGEN1_LENGTH                   0x00000001

#define _ADCCON3_DIGEN7_POSITION                 0x00000017
#define _ADCCON3_DIGEN7_MASK                     0x00800000
#define _ADCCON3_DIGEN7_LENGTH                   0x00000001

#define _ADCCON3_CONCLKDIV_POSITION              0x00000018
#define _ADCCON3_CONCLKDIV_MASK                  0x3F000000
#define _ADCCON3_CONCLKDIV_LENGTH                0x00000006

#define _ADCCON3_ADCSEL_POSITION                 0x0000001E
#define _ADCCON3_ADCSEL_MASK                     0xC0000000
#define _ADCCON3_ADCSEL_LENGTH                   0x00000002

#define _ADCTRGMODE_SSAMPEN0_POSITION            0x00000000
#define _ADCTRGMODE_SSAMPEN0_MASK                0x00000001
#define _ADCTRGMODE_SSAMPEN0_LENGTH              0x00000001

#define _ADCTRGMODE_SSAMPEN1_POSITION            0x00000001
#define _ADCTRGMODE_SSAMPEN1_MASK                0x00000002
#define _ADCTRGMODE_SSAMPEN1_LENGTH              0x00000001

#define _ADCTRGMODE_STRGEN0_POSITION             0x00000008
#define _ADCTRGMODE_STRGEN0_MASK                 0x00000100
#define _ADCTRGMODE_STRGEN0_LENGTH               0x00000001

#define _ADCTRGMODE_STRGEN1_POSITION             0x00000009
#define _ADCTRGMODE_STRGEN1_MASK                 0x00000200
#define _ADCTRGMODE_STRGEN1_LENGTH               0x00000001

#define _ADCTRGMODE_SH0ALT_POSITION              0x00000010
#define _ADCTRGMODE_SH0ALT_MASK                  0x00030000
#define _ADCTRGMODE_SH0ALT_LENGTH                0x00000002

#define _ADCTRGMODE_SH1ALT_POSITION              0x00000012
#define _ADCTRGMODE_SH1ALT_MASK                  0x000C0000
#define _ADCTRGMODE_SH1ALT_LENGTH                0x00000002

#define _ADCIMCON1_SIGN0_POSITION                0x00000000
#define _ADCIMCON1_SIGN0_MASK                    0x00000001
#define _ADCIMCON1_SIGN0_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF0_POSITION                0x00000001
#define _ADCIMCON1_DIFF0_MASK                    0x00000002
#define _ADCIMCON1_DIFF0_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN1_POSITION                0x00000002
#define _ADCIMCON1_SIGN1_MASK                    0x00000004
#define _ADCIMCON1_SIGN1_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF1_POSITION                0x00000003
#define _ADCIMCON1_DIFF1_MASK                    0x00000008
#define _ADCIMCON1_DIFF1_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN2_POSITION                0x00000004
#define _ADCIMCON1_SIGN2_MASK                    0x00000010
#define _ADCIMCON1_SIGN2_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF2_POSITION                0x00000005
#define _ADCIMCON1_DIFF2_MASK                    0x00000020
#define _ADCIMCON1_DIFF2_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN3_POSITION                0x00000006
#define _ADCIMCON1_SIGN3_MASK                    0x00000040
#define _ADCIMCON1_SIGN3_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF3_POSITION                0x00000007
#define _ADCIMCON1_DIFF3_MASK                    0x00000080
#define _ADCIMCON1_DIFF3_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN4_POSITION                0x00000008
#define _ADCIMCON1_SIGN4_MASK                    0x00000100
#define _ADCIMCON1_SIGN4_LENGTH                  0x00000001

#define _ADCIMCON1_DIFF4_POSITION                0x00000009
#define _ADCIMCON1_DIFF4_MASK                    0x00000200
#define _ADCIMCON1_DIFF4_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN5_POSITION                0x0000000A
#define _ADCIMCON1_SIGN5_MASK                    0x00000400
#define _ADCIMCON1_SIGN5_LENGTH                  0x00000001

