Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _ADCIMCON1_DIFF5_POSITION                0x0000000B
#define _ADCIMCON1_DIFF5_MASK                    0x00000800
#define _ADCIMCON1_DIFF5_LENGTH                  0x00000001

#define _ADCIMCON1_SIGN13_POSITION               0x0000001A
#define _ADCIMCON1_SIGN13_MASK                   0x04000000
#define _ADCIMCON1_SIGN13_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF13_POSITION               0x0000001B
#define _ADCIMCON1_DIFF13_MASK                   0x08000000
#define _ADCIMCON1_DIFF13_LENGTH                 0x00000001

#define _ADCIMCON1_SIGN15_POSITION               0x0000001E
#define _ADCIMCON1_SIGN15_MASK                   0x40000000
#define _ADCIMCON1_SIGN15_LENGTH                 0x00000001

#define _ADCIMCON1_DIFF15_POSITION               0x0000001F
#define _ADCIMCON1_DIFF15_MASK                   0x80000000
#define _ADCIMCON1_DIFF15_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN16_POSITION               0x00000000
#define _ADCIMCON2_SIGN16_MASK                   0x00000001
#define _ADCIMCON2_SIGN16_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF16_POSITION               0x00000001
#define _ADCIMCON2_DIFF16_MASK                   0x00000002
#define _ADCIMCON2_DIFF16_LENGTH                 0x00000001

#define _ADCIMCON2_SIGN17_POSITION               0x00000002
#define _ADCIMCON2_SIGN17_MASK                   0x00000004
#define _ADCIMCON2_SIGN17_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF17_POSITION               0x00000003
#define _ADCIMCON2_DIFF17_MASK                   0x00000008
#define _ADCIMCON2_DIFF17_LENGTH                 0x00000001

#define _ADCGIRQEN1_AGIEN0_POSITION              0x00000000
#define _ADCGIRQEN1_AGIEN0_MASK                  0x00000001
#define _ADCGIRQEN1_AGIEN0_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN1_POSITION              0x00000001
#define _ADCGIRQEN1_AGIEN1_MASK                  0x00000002
#define _ADCGIRQEN1_AGIEN1_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN2_POSITION              0x00000002
#define _ADCGIRQEN1_AGIEN2_MASK                  0x00000004
#define _ADCGIRQEN1_AGIEN2_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN3_POSITION              0x00000003
#define _ADCGIRQEN1_AGIEN3_MASK                  0x00000008
#define _ADCGIRQEN1_AGIEN3_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN4_POSITION              0x00000004
#define _ADCGIRQEN1_AGIEN4_MASK                  0x00000010
#define _ADCGIRQEN1_AGIEN4_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN5_POSITION              0x00000005
#define _ADCGIRQEN1_AGIEN5_MASK                  0x00000020
#define _ADCGIRQEN1_AGIEN5_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN13_POSITION             0x0000000D
#define _ADCGIRQEN1_AGIEN13_MASK                 0x00002000
#define _ADCGIRQEN1_AGIEN13_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN15_POSITION             0x0000000F
#define _ADCGIRQEN1_AGIEN15_MASK                 0x00008000
#define _ADCGIRQEN1_AGIEN15_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN16_POSITION             0x00000010
#define _ADCGIRQEN1_AGIEN16_MASK                 0x00010000
#define _ADCGIRQEN1_AGIEN16_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN17_POSITION             0x00000011
#define _ADCGIRQEN1_AGIEN17_MASK                 0x00020000
#define _ADCGIRQEN1_AGIEN17_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN50_POSITION             0x00000012
#define _ADCGIRQEN2_AGIEN50_MASK                 0x00040000
#define _ADCGIRQEN2_AGIEN50_LENGTH               0x00000001

#define _ADCGIRQEN2_AGIEN53_POSITION             0x00000015
#define _ADCGIRQEN2_AGIEN53_MASK                 0x00200000
#define _ADCGIRQEN2_AGIEN53_LENGTH               0x00000001

#define _ADCCSS1_CSS0_POSITION                   0x00000000
#define _ADCCSS1_CSS0_MASK                       0x00000001
#define _ADCCSS1_CSS0_LENGTH                     0x00000001

#define _ADCCSS1_CSS1_POSITION                   0x00000001
#define _ADCCSS1_CSS1_MASK                       0x00000002
#define _ADCCSS1_CSS1_LENGTH                     0x00000001

#define _ADCCSS1_CSS2_POSITION                   0x00000002
#define _ADCCSS1_CSS2_MASK                       0x00000004
#define _ADCCSS1_CSS2_LENGTH                     0x00000001

#define _ADCCSS1_CSS3_POSITION                   0x00000003
#define _ADCCSS1_CSS3_MASK                       0x00000008
#define _ADCCSS1_CSS3_LENGTH                     0x00000001

#define _ADCCSS1_CSS4_POSITION                   0x00000004
#define _ADCCSS1_CSS4_MASK                       0x00000010
#define _ADCCSS1_CSS4_LENGTH                     0x00000001

#define _ADCCSS1_CSS5_POSITION                   0x00000005
#define _ADCCSS1_CSS5_MASK                       0x00000020
#define _ADCCSS1_CSS5_LENGTH                     0x00000001

#define _ADCCSS1_CSS13_POSITION                  0x0000000D
#define _ADCCSS1_CSS13_MASK                      0x00002000
#define _ADCCSS1_CSS13_LENGTH                    0x00000001

#define _ADCCSS1_CSS15_POSITION                  0x0000000F
#define _ADCCSS1_CSS15_MASK                      0x00008000
#define _ADCCSS1_CSS15_LENGTH                    0x00000001

#define _ADCCSS1_CSS16_POSITION                  0x00000010
#define _ADCCSS1_CSS16_MASK                      0x00010000
#define _ADCCSS1_CSS16_LENGTH                    0x00000001

#define _ADCCSS1_CSS17_POSITION                  0x00000011
#define _ADCCSS1_CSS17_MASK                      0x00020000
#define _ADCCSS1_CSS17_LENGTH                    0x00000001

#define _ADCCSS2_CSS50_POSITION                  0x00000012
#define _ADCCSS2_CSS50_MASK                      0x00040000
#define _ADCCSS2_CSS50_LENGTH                    0x00000001

#define _ADCCSS2_CSS53_POSITION                  0x00000015
#define _ADCCSS2_CSS53_MASK                      0x00200000
#define _ADCCSS2_CSS53_LENGTH                    0x00000001

#define _ADCDSTAT1_ARDY0_POSITION                0x00000000
#define _ADCDSTAT1_ARDY0_MASK                    0x00000001
#define _ADCDSTAT1_ARDY0_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY1_POSITION                0x00000001
#define _ADCDSTAT1_ARDY1_MASK                    0x00000002
#define _ADCDSTAT1_ARDY1_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY2_POSITION                0x00000002
#define _ADCDSTAT1_ARDY2_MASK                    0x00000004
#define _ADCDSTAT1_ARDY2_LENGTH                  0x00000001

