Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _ADCDSTAT1_ARDY3_POSITION                0x00000003
#define _ADCDSTAT1_ARDY3_MASK                    0x00000008
#define _ADCDSTAT1_ARDY3_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY4_POSITION                0x00000004
#define _ADCDSTAT1_ARDY4_MASK                    0x00000010
#define _ADCDSTAT1_ARDY4_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY5_POSITION                0x00000005
#define _ADCDSTAT1_ARDY5_MASK                    0x00000020
#define _ADCDSTAT1_ARDY5_LENGTH                  0x00000001

#define _ADCDSTAT1_ARDY13_POSITION               0x0000000D
#define _ADCDSTAT1_ARDY13_MASK                   0x00002000
#define _ADCDSTAT1_ARDY13_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY15_POSITION               0x0000000F
#define _ADCDSTAT1_ARDY15_MASK                   0x00008000
#define _ADCDSTAT1_ARDY15_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY16_POSITION               0x00000010
#define _ADCDSTAT1_ARDY16_MASK                   0x00010000
#define _ADCDSTAT1_ARDY16_LENGTH                 0x00000001

#define _ADCDSTAT1_ARDY17_POSITION               0x00000011
#define _ADCDSTAT1_ARDY17_MASK                   0x00020000
#define _ADCDSTAT1_ARDY17_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY50_POSITION               0x00000012
#define _ADCDSTAT2_ARDY50_MASK                   0x00040000
#define _ADCDSTAT2_ARDY50_LENGTH                 0x00000001

#define _ADCDSTAT2_ARDY53_POSITION               0x00000015
#define _ADCDSTAT2_ARDY53_MASK                   0x00200000
#define _ADCDSTAT2_ARDY53_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE0_POSITION                0x00000000
#define _ADCCMPEN1_CMPE0_MASK                    0x00000001
#define _ADCCMPEN1_CMPE0_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE1_POSITION                0x00000001
#define _ADCCMPEN1_CMPE1_MASK                    0x00000002
#define _ADCCMPEN1_CMPE1_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE2_POSITION                0x00000002
#define _ADCCMPEN1_CMPE2_MASK                    0x00000004
#define _ADCCMPEN1_CMPE2_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE3_POSITION                0x00000003
#define _ADCCMPEN1_CMPE3_MASK                    0x00000008
#define _ADCCMPEN1_CMPE3_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE4_POSITION                0x00000004
#define _ADCCMPEN1_CMPE4_MASK                    0x00000010
#define _ADCCMPEN1_CMPE4_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE5_POSITION                0x00000005
#define _ADCCMPEN1_CMPE5_MASK                    0x00000020
#define _ADCCMPEN1_CMPE5_LENGTH                  0x00000001

#define _ADCCMPEN1_CMPE13_POSITION               0x0000000D
#define _ADCCMPEN1_CMPE13_MASK                   0x00002000
#define _ADCCMPEN1_CMPE13_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE15_POSITION               0x0000000F
#define _ADCCMPEN1_CMPE15_MASK                   0x00008000
#define _ADCCMPEN1_CMPE15_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE16_POSITION               0x00000010
#define _ADCCMPEN1_CMPE16_MASK                   0x00010000
#define _ADCCMPEN1_CMPE16_LENGTH                 0x00000001

#define _ADCCMPEN1_CMPE17_POSITION               0x00000011
#define _ADCCMPEN1_CMPE17_MASK                   0x00020000
#define _ADCCMPEN1_CMPE17_LENGTH                 0x00000001

#define _ADCCMP1_DCMPLO_POSITION                 0x00000000
#define _ADCCMP1_DCMPLO_MASK                     0x0000FFFF
#define _ADCCMP1_DCMPLO_LENGTH                   0x00000010

#define _ADCCMP1_DCMPHI_POSITION                 0x00000010
#define _ADCCMP1_DCMPHI_MASK                     0xFFFF0000
#define _ADCCMP1_DCMPHI_LENGTH                   0x00000010

#define _ADCCMPEN2_CMPE0_POSITION                0x00000000
#define _ADCCMPEN2_CMPE0_MASK                    0x00000001
#define _ADCCMPEN2_CMPE0_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE1_POSITION                0x00000001
#define _ADCCMPEN2_CMPE1_MASK                    0x00000002
#define _ADCCMPEN2_CMPE1_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE2_POSITION                0x00000002
#define _ADCCMPEN2_CMPE2_MASK                    0x00000004
#define _ADCCMPEN2_CMPE2_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE3_POSITION                0x00000003
#define _ADCCMPEN2_CMPE3_MASK                    0x00000008
#define _ADCCMPEN2_CMPE3_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE4_POSITION                0x00000004
#define _ADCCMPEN2_CMPE4_MASK                    0x00000010
#define _ADCCMPEN2_CMPE4_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE5_POSITION                0x00000005
#define _ADCCMPEN2_CMPE5_MASK                    0x00000020
#define _ADCCMPEN2_CMPE5_LENGTH                  0x00000001

#define _ADCCMPEN2_CMPE13_POSITION               0x0000000D
#define _ADCCMPEN2_CMPE13_MASK                   0x00002000
#define _ADCCMPEN2_CMPE13_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE15_POSITION               0x0000000F
#define _ADCCMPEN2_CMPE15_MASK                   0x00008000
#define _ADCCMPEN2_CMPE15_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE16_POSITION               0x00000010
#define _ADCCMPEN2_CMPE16_MASK                   0x00010000
#define _ADCCMPEN2_CMPE16_LENGTH                 0x00000001

#define _ADCCMPEN2_CMPE17_POSITION               0x00000011
#define _ADCCMPEN2_CMPE17_MASK                   0x00020000
#define _ADCCMPEN2_CMPE17_LENGTH                 0x00000001

#define _ADCCMP2_DCMPLO_POSITION                 0x00000000
#define _ADCCMP2_DCMPLO_MASK                     0x0000FFFF
#define _ADCCMP2_DCMPLO_LENGTH                   0x00000010

#define _ADCCMP2_DCMPHI_POSITION                 0x00000010
#define _ADCCMP2_DCMPHI_MASK                     0xFFFF0000
#define _ADCCMP2_DCMPHI_LENGTH                   0x00000010

#define _ADCFLTR1_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR1_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR1_FLTRDATA_LENGTH                0x00000010

