Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _ADCCMPCON2_IEHILO_POSITION              0x00000002
#define _ADCCMPCON2_IEHILO_MASK                  0x00000004
#define _ADCCMPCON2_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON2_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON2_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON2_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON2_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON2_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON2_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPED_POSITION              0x00000005
#define _ADCCMPCON2_DCMPED_MASK                  0x00000020
#define _ADCCMPCON2_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON2_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON2_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON2_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON2_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON2_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON2_AINID_POSITION               0x00000008
#define _ADCCMPCON2_AINID_MASK                   0x00001F00
#define _ADCCMPCON2_AINID_LENGTH                 0x00000005

#define _ADCBASE_ADCBASE_POSITION                0x00000000
#define _ADCBASE_ADCBASE_MASK                    0x0000FFFF
#define _ADCBASE_ADCBASE_LENGTH                  0x00000010

#define _ADCDSTAT_RAF0_POSITION                  0x00000000
#define _ADCDSTAT_RAF0_MASK                      0x00000001
#define _ADCDSTAT_RAF0_LENGTH                    0x00000001

#define _ADCDSTAT_RAF1_POSITION                  0x00000001
#define _ADCDSTAT_RAF1_MASK                      0x00000002
#define _ADCDSTAT_RAF1_LENGTH                    0x00000001

#define _ADCDSTAT_RAFIEN0_POSITION               0x00000008
#define _ADCDSTAT_RAFIEN0_MASK                   0x00000100
#define _ADCDSTAT_RAFIEN0_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN1_POSITION               0x00000009
#define _ADCDSTAT_RAFIEN1_MASK                   0x00000200
#define _ADCDSTAT_RAFIEN1_LENGTH                 0x00000001

#define _ADCDSTAT_DMACEN_POSITION                0x0000000F
#define _ADCDSTAT_DMACEN_MASK                    0x00008000
#define _ADCDSTAT_DMACEN_LENGTH                  0x00000001

#define _ADCDSTAT_RBF0_POSITION                  0x00000010
#define _ADCDSTAT_RBF0_MASK                      0x00010000
#define _ADCDSTAT_RBF0_LENGTH                    0x00000001

#define _ADCDSTAT_RBF1_POSITION                  0x00000011
#define _ADCDSTAT_RBF1_MASK                      0x00020000
#define _ADCDSTAT_RBF1_LENGTH                    0x00000001

#define _ADCDSTAT_WOVERR_POSITION                0x00000017
#define _ADCDSTAT_WOVERR_MASK                    0x00800000
#define _ADCDSTAT_WOVERR_LENGTH                  0x00000001

#define _ADCDSTAT_RBFIEN0_POSITION               0x00000018
#define _ADCDSTAT_RBFIEN0_MASK                   0x01000000
#define _ADCDSTAT_RBFIEN0_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN1_POSITION               0x00000019
#define _ADCDSTAT_RBFIEN1_MASK                   0x02000000
#define _ADCDSTAT_RBFIEN1_LENGTH                 0x00000001

#define _ADCDSTAT_DMAEN_POSITION                 0x0000001F
#define _ADCDSTAT_DMAEN_MASK                     0x80000000
#define _ADCDSTAT_DMAEN_LENGTH                   0x00000001

#define _ADCCNTB_ADCCNTB_POSITION                0x00000000
#define _ADCCNTB_ADCCNTB_MASK                    0xFFFFFFFF
#define _ADCCNTB_ADCCNTB_LENGTH                  0x00000020

#define _ADCDMAB_ADCDMAB_POSITION                0x00000000
#define _ADCDMAB_ADCDMAB_MASK                    0xFFFFFFFF
#define _ADCDMAB_ADCDMAB_LENGTH                  0x00000020

#define _ADCTRGSNS_LVL0_POSITION                 0x00000000
#define _ADCTRGSNS_LVL0_MASK                     0x00000001
#define _ADCTRGSNS_LVL0_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL1_POSITION                 0x00000001
#define _ADCTRGSNS_LVL1_MASK                     0x00000002
#define _ADCTRGSNS_LVL1_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL2_POSITION                 0x00000002
#define _ADCTRGSNS_LVL2_MASK                     0x00000004
#define _ADCTRGSNS_LVL2_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL3_POSITION                 0x00000003
#define _ADCTRGSNS_LVL3_MASK                     0x00000008
#define _ADCTRGSNS_LVL3_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL4_POSITION                 0x00000004
#define _ADCTRGSNS_LVL4_MASK                     0x00000010
#define _ADCTRGSNS_LVL4_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL5_POSITION                 0x00000005
#define _ADCTRGSNS_LVL5_MASK                     0x00000020
#define _ADCTRGSNS_LVL5_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL13_POSITION                0x0000000D
#define _ADCTRGSNS_LVL13_MASK                    0x00002000
#define _ADCTRGSNS_LVL13_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL15_POSITION                0x0000000F
#define _ADCTRGSNS_LVL15_MASK                    0x00008000
#define _ADCTRGSNS_LVL15_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL16_POSITION                0x00000010
#define _ADCTRGSNS_LVL16_MASK                    0x00010000
#define _ADCTRGSNS_LVL16_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL17_POSITION                0x00000011
#define _ADCTRGSNS_LVL17_MASK                    0x00020000
#define _ADCTRGSNS_LVL17_LENGTH                  0x00000001

#define _ADC0TIME_SAMC_POSITION                  0x00000000
#define _ADC0TIME_SAMC_MASK                      0x000003FF
#define _ADC0TIME_SAMC_LENGTH                    0x0000000A

#define _ADC0TIME_ADCDIV_POSITION                0x00000010
#define _ADC0TIME_ADCDIV_MASK                    0x007F0000
#define _ADC0TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC0TIME_BCHEN_POSITION                 0x00000017
#define _ADC0TIME_BCHEN_MASK                     0x00800000
#define _ADC0TIME_BCHEN_LENGTH                   0x00000001

#define _ADC0TIME_SELRES_POSITION                0x00000018
#define _ADC0TIME_SELRES_MASK                    0x03000000
#define _ADC0TIME_SELRES_LENGTH                  0x00000002

#define _ADC0TIME_ADCEIS_POSITION                0x0000001A
#define _ADC0TIME_ADCEIS_MASK                    0x1C000000
#define _ADC0TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC1TIME_SAMC_POSITION                  0x00000000
#define _ADC1TIME_SAMC_MASK                      0x000003FF
#define _ADC1TIME_SAMC_LENGTH                    0x0000000A

#define _ADC1TIME_ADCDIV_POSITION                0x00000010
#define _ADC1TIME_ADCDIV_MASK                    0x007F0000
#define _ADC1TIME_ADCDIV_LENGTH                  0x00000007

