Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _ADCDATA2_DATA_POSITION                  0x00000000
#define _ADCDATA2_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA2_DATA_LENGTH                    0x00000020

#define _ADCDATA3_DATA_POSITION                  0x00000000
#define _ADCDATA3_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA3_DATA_LENGTH                    0x00000020

#define _ADCDATA4_DATA_POSITION                  0x00000000
#define _ADCDATA4_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA4_DATA_LENGTH                    0x00000020

#define _ADCDATA5_DATA_POSITION                  0x00000000
#define _ADCDATA5_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA5_DATA_LENGTH                    0x00000020

#define _ADCDATA13_DATA_POSITION                 0x00000000
#define _ADCDATA13_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA13_DATA_LENGTH                   0x00000020

#define _ADCDATA15_DATA_POSITION                 0x00000000
#define _ADCDATA15_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA15_DATA_LENGTH                   0x00000020

#define _ADCDATA16_DATA_POSITION                 0x00000000
#define _ADCDATA16_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA16_DATA_LENGTH                   0x00000020

#define _ADCDATA17_DATA_POSITION                 0x00000000
#define _ADCDATA17_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA17_DATA_LENGTH                   0x00000020

#define _ADCDATA50_DATA_POSITION                 0x00000000
#define _ADCDATA50_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA50_DATA_LENGTH                   0x00000020

#define _ADCDATA53_DATA_POSITION                 0x00000000
#define _ADCDATA53_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA53_DATA_LENGTH                   0x00000020

#define _ADC0CFG_ADCCFG_POSITION                 0x00000000
#define _ADC0CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC0CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC1CFG_ADCCFG_POSITION                 0x00000000
#define _ADC1CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC1CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC7CFG_ADCCFG_POSITION                 0x00000000
#define _ADC7CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC7CFG_ADCCFG_LENGTH                   0x00000020

#define _ADCSYSCFG0_AN0_POSITION                 0x00000000
#define _ADCSYSCFG0_AN0_MASK                     0x00000001
#define _ADCSYSCFG0_AN0_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN1_POSITION                 0x00000001
#define _ADCSYSCFG0_AN1_MASK                     0x00000002
#define _ADCSYSCFG0_AN1_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN2_POSITION                 0x00000002
#define _ADCSYSCFG0_AN2_MASK                     0x00000004
#define _ADCSYSCFG0_AN2_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN3_POSITION                 0x00000003
#define _ADCSYSCFG0_AN3_MASK                     0x00000008
#define _ADCSYSCFG0_AN3_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN4_POSITION                 0x00000004
#define _ADCSYSCFG0_AN4_MASK                     0x00000010
#define _ADCSYSCFG0_AN4_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN5_POSITION                 0x00000005
#define _ADCSYSCFG0_AN5_MASK                     0x00000020
#define _ADCSYSCFG0_AN5_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN13_POSITION                0x0000000D
#define _ADCSYSCFG0_AN13_MASK                    0x00002000
#define _ADCSYSCFG0_AN13_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN15_POSITION                0x0000000F
#define _ADCSYSCFG0_AN15_MASK                    0x00008000
#define _ADCSYSCFG0_AN15_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN16_POSITION                0x00000010
#define _ADCSYSCFG0_AN16_MASK                    0x00010000
#define _ADCSYSCFG0_AN16_LENGTH                  0x00000001

#define _ADCSYSCFG0_AN17_POSITION                0x00000011
#define _ADCSYSCFG0_AN17_MASK                    0x00020000
#define _ADCSYSCFG0_AN17_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN50_POSITION                0x00000012
#define _ADCSYSCFG1_AN50_MASK                    0x00040000
#define _ADCSYSCFG1_AN50_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN53_POSITION                0x00000015
#define _ADCSYSCFG1_AN53_MASK                    0x00200000
#define _ADCSYSCFG1_AN53_LENGTH                  0x00000001

#define _RTCCON_RTCOE_POSITION                   0x00000000
#define _RTCCON_RTCOE_MASK                       0x00000001
#define _RTCCON_RTCOE_LENGTH                     0x00000001

#define _RTCCON_HALFSEC_POSITION                 0x00000001
#define _RTCCON_HALFSEC_MASK                     0x00000002
#define _RTCCON_HALFSEC_LENGTH                   0x00000001

#define _RTCCON_RTCSYNC_POSITION                 0x00000002
#define _RTCCON_RTCSYNC_MASK                     0x00000004
#define _RTCCON_RTCSYNC_LENGTH                   0x00000001

#define _RTCCON_RTCWREN_POSITION                 0x00000003
#define _RTCCON_RTCWREN_MASK                     0x00000008
#define _RTCCON_RTCWREN_LENGTH                   0x00000001

#define _RTCCON_RTCCLKON_POSITION                0x00000006
#define _RTCCON_RTCCLKON_MASK                    0x00000040
#define _RTCCON_RTCCLKON_LENGTH                  0x00000001

#define _RTCCON_RTCOUTSEL_POSITION               0x00000007
#define _RTCCON_RTCOUTSEL_MASK                   0x00000180
#define _RTCCON_RTCOUTSEL_LENGTH                 0x00000002

#define _RTCCON_RTCCLKSEL_POSITION               0x00000009
#define _RTCCON_RTCCLKSEL_MASK                   0x00000600
#define _RTCCON_RTCCLKSEL_LENGTH                 0x00000002

#define _RTCCON_SIDL_POSITION                    0x0000000D
#define _RTCCON_SIDL_MASK                        0x00002000
#define _RTCCON_SIDL_LENGTH                      0x00000001

#define _RTCCON_ON_POSITION                      0x0000000F
#define _RTCCON_ON_MASK                          0x00008000
#define _RTCCON_ON_LENGTH                        0x00000001

#define _RTCCON_CAL_POSITION                     0x00000010
#define _RTCCON_CAL_MASK                         0x03FF0000
#define _RTCCON_CAL_LENGTH                       0x0000000A

#define _RTCCON_w_POSITION                       0x00000000
#define _RTCCON_w_MASK                           0xFFFFFFFF
#define _RTCCON_w_LENGTH                         0x00000020

