Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _SEQ_CSEQ_POSITION                       0x00000010
#define _SEQ_CSEQ_MASK                           0xFFFF0000
#define _SEQ_CSEQ_LENGTH                         0x00000010

#define _SEQ_w_POSITION                          0x00000000
#define _SEQ_w_MASK                              0xFFFFFFFF
#define _SEQ_w_LENGTH                            0x00000020

#define _DEVADC0_ADCCALDATA_POSITION             0x00000000
#define _DEVADC0_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC0_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC0_w_POSITION                      0x00000000
#define _DEVADC0_w_MASK                          0xFFFFFFFF
#define _DEVADC0_w_LENGTH                        0x00000020

#define _DEVADC1_ADCCALDATA_POSITION             0x00000000
#define _DEVADC1_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC1_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC1_w_POSITION                      0x00000000
#define _DEVADC1_w_MASK                          0xFFFFFFFF
#define _DEVADC1_w_LENGTH                        0x00000020

#define _DEVADC7_ADCCALDATA_POSITION             0x00000000
#define _DEVADC7_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC7_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC7_w_POSITION                      0x00000000
#define _DEVADC7_w_MASK                          0xFFFFFFFF
#define _DEVADC7_w_LENGTH                        0x00000020

#define _DEVSN0_SN_POSITION                      0x00000000
#define _DEVSN0_SN_MASK                          0xFFFFFFFF
#define _DEVSN0_SN_LENGTH                        0x00000020

#define _DEVSN0_w_POSITION                       0x00000000
#define _DEVSN0_w_MASK                           0xFFFFFFFF
#define _DEVSN0_w_LENGTH                         0x00000020

#define _DEVSN1_SN_POSITION                      0x00000000
#define _DEVSN1_SN_MASK                          0xFFFFFFFF
#define _DEVSN1_SN_LENGTH                        0x00000020

#define _DEVSN1_w_POSITION                       0x00000000
#define _DEVSN1_w_MASK                           0xFFFFFFFF
#define _DEVSN1_w_LENGTH                         0x00000020

#define _DEVSN2_SN_POSITION                      0x00000000
#define _DEVSN2_SN_MASK                          0xFFFFFFFF
#define _DEVSN2_SN_LENGTH                        0x00000020

#define _DEVSN2_w_POSITION                       0x00000000
#define _DEVSN2_w_MASK                           0xFFFFFFFF
#define _DEVSN2_w_LENGTH                         0x00000020

#define _DEVSN3_SN_POSITION                      0x00000000
#define _DEVSN3_SN_MASK                          0xFFFFFFFF
#define _DEVSN3_SN_LENGTH                        0x00000020

#define _DEVSN3_w_POSITION                       0x00000000
#define _DEVSN3_w_MASK                           0xFFFFFFFF
#define _DEVSN3_w_LENGTH                         0x00000020

#define _ADEVCFG3_USERID_POSITION                0x00000000
#define _ADEVCFG3_USERID_MASK                    0x0000FFFF
#define _ADEVCFG3_USERID_LENGTH                  0x00000010

#define _ADEVCFG3_PWMLOCK_POSITION               0x00000014
#define _ADEVCFG3_PWMLOCK_MASK                   0x00100000
#define _ADEVCFG3_PWMLOCK_LENGTH                 0x00000001

#define _ADEVCFG3_PGL1WAY_POSITION               0x0000001B
#define _ADEVCFG3_PGL1WAY_MASK                   0x08000000
#define _ADEVCFG3_PGL1WAY_LENGTH                 0x00000001

#define _ADEVCFG3_PMDL1WAY_POSITION              0x0000001C
#define _ADEVCFG3_PMDL1WAY_MASK                  0x10000000
#define _ADEVCFG3_PMDL1WAY_LENGTH                0x00000001

#define _ADEVCFG3_IOL1WAY_POSITION               0x0000001D
#define _ADEVCFG3_IOL1WAY_MASK                   0x20000000
#define _ADEVCFG3_IOL1WAY_LENGTH                 0x00000001

#define _ADEVCFG3_w_POSITION                     0x00000000
#define _ADEVCFG3_w_MASK                         0xFFFFFFFF
#define _ADEVCFG3_w_LENGTH                       0x00000020

#define _ADEVCFG2_FPLLIDIV_POSITION              0x00000000
#define _ADEVCFG2_FPLLIDIV_MASK                  0x00000007
#define _ADEVCFG2_FPLLIDIV_LENGTH                0x00000003

#define _ADEVCFG2_FPLLRNG_POSITION               0x00000004
#define _ADEVCFG2_FPLLRNG_MASK                   0x00000070
#define _ADEVCFG2_FPLLRNG_LENGTH                 0x00000003

#define _ADEVCFG2_FPLLICLK_POSITION              0x00000007
#define _ADEVCFG2_FPLLICLK_MASK                  0x00000080
#define _ADEVCFG2_FPLLICLK_LENGTH                0x00000001

#define _ADEVCFG2_FPLLMULT_POSITION              0x00000008
#define _ADEVCFG2_FPLLMULT_MASK                  0x00007F00
#define _ADEVCFG2_FPLLMULT_LENGTH                0x00000007

#define _ADEVCFG2_FPLLODIV_POSITION              0x00000010
#define _ADEVCFG2_FPLLODIV_MASK                  0x00070000
#define _ADEVCFG2_FPLLODIV_LENGTH                0x00000003

#define _ADEVCFG2_BORSEL_POSITION                0x0000001D
#define _ADEVCFG2_BORSEL_MASK                    0x20000000
#define _ADEVCFG2_BORSEL_LENGTH                  0x00000001

#define _ADEVCFG2_w_POSITION                     0x00000000
#define _ADEVCFG2_w_MASK                         0xFFFFFFFF
#define _ADEVCFG2_w_LENGTH                       0x00000020

#define _ADEVCFG1_FNOSC_POSITION                 0x00000000
#define _ADEVCFG1_FNOSC_MASK                     0x00000007
#define _ADEVCFG1_FNOSC_LENGTH                   0x00000003

#define _ADEVCFG1_DMTINTV_POSITION               0x00000003
#define _ADEVCFG1_DMTINTV_MASK                   0x00000038
#define _ADEVCFG1_DMTINTV_LENGTH                 0x00000003

#define _ADEVCFG1_FSOSCEN_POSITION               0x00000006
#define _ADEVCFG1_FSOSCEN_MASK                   0x00000040
#define _ADEVCFG1_FSOSCEN_LENGTH                 0x00000001

#define _ADEVCFG1_IESO_POSITION                  0x00000007
#define _ADEVCFG1_IESO_MASK                      0x00000080
#define _ADEVCFG1_IESO_LENGTH                    0x00000001

#define _ADEVCFG1_POSCMOD_POSITION               0x00000008
#define _ADEVCFG1_POSCMOD_MASK                   0x00000300
#define _ADEVCFG1_POSCMOD_LENGTH                 0x00000002

