Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _ABF1DEVCFG0_POSCFGAIN_POSITION          0x00000016
#define _ABF1DEVCFG0_POSCFGAIN_MASK              0x00C00000
#define _ABF1DEVCFG0_POSCFGAIN_LENGTH            0x00000002

#define _ABF1DEVCFG0_POSCAGCDLY_POSITION         0x00000018
#define _ABF1DEVCFG0_POSCAGCDLY_MASK             0x03000000
#define _ABF1DEVCFG0_POSCAGCDLY_LENGTH           0x00000002

#define _ABF1DEVCFG0_POSCAGCRNG_POSITION         0x0000001A
#define _ABF1DEVCFG0_POSCAGCRNG_MASK             0x04000000
#define _ABF1DEVCFG0_POSCAGCRNG_LENGTH           0x00000001

#define _ABF1DEVCFG0_POSCAGC_POSITION            0x0000001B
#define _ABF1DEVCFG0_POSCAGC_MASK                0x08000000
#define _ABF1DEVCFG0_POSCAGC_LENGTH              0x00000001

#define _ABF1DEVCFG0_EJTAGBEN_POSITION           0x0000001E
#define _ABF1DEVCFG0_EJTAGBEN_MASK               0x40000000
#define _ABF1DEVCFG0_EJTAGBEN_LENGTH             0x00000001

#define _ABF1DEVCFG0_FDEBUG_POSITION             0x00000000
#define _ABF1DEVCFG0_FDEBUG_MASK                 0x00000003
#define _ABF1DEVCFG0_FDEBUG_LENGTH               0x00000002

#define _ABF1DEVCFG0_w_POSITION                  0x00000000
#define _ABF1DEVCFG0_w_MASK                      0xFFFFFFFF
#define _ABF1DEVCFG0_w_LENGTH                    0x00000020

#define _ABF1DEVCP_CP_POSITION                   0x0000001C
#define _ABF1DEVCP_CP_MASK                       0x10000000
#define _ABF1DEVCP_CP_LENGTH                     0x00000001

#define _ABF1DEVCP_w_POSITION                    0x00000000
#define _ABF1DEVCP_w_MASK                        0xFFFFFFFF
#define _ABF1DEVCP_w_LENGTH                      0x00000020

#define _ABF1SEQ_TSEQ_POSITION                   0x00000000
#define _ABF1SEQ_TSEQ_MASK                       0x0000FFFF
#define _ABF1SEQ_TSEQ_LENGTH                     0x00000010

#define _ABF1SEQ_CSEQ_POSITION                   0x00000010
#define _ABF1SEQ_CSEQ_MASK                       0xFFFF0000
#define _ABF1SEQ_CSEQ_LENGTH                     0x00000010

#define _ABF1SEQ_w_POSITION                      0x00000000
#define _ABF1SEQ_w_MASK                          0xFFFFFFFF
#define _ABF1SEQ_w_LENGTH                        0x00000020

#define _BF1DEVCFG3_USERID_POSITION              0x00000000
#define _BF1DEVCFG3_USERID_MASK                  0x0000FFFF
#define _BF1DEVCFG3_USERID_LENGTH                0x00000010

#define _BF1DEVCFG3_PWMLOCK_POSITION             0x00000014
#define _BF1DEVCFG3_PWMLOCK_MASK                 0x00100000
#define _BF1DEVCFG3_PWMLOCK_LENGTH               0x00000001

#define _BF1DEVCFG3_PGL1WAY_POSITION             0x0000001B
#define _BF1DEVCFG3_PGL1WAY_MASK                 0x08000000
#define _BF1DEVCFG3_PGL1WAY_LENGTH               0x00000001

#define _BF1DEVCFG3_PMDL1WAY_POSITION            0x0000001C
#define _BF1DEVCFG3_PMDL1WAY_MASK                0x10000000
#define _BF1DEVCFG3_PMDL1WAY_LENGTH              0x00000001

#define _BF1DEVCFG3_IOL1WAY_POSITION             0x0000001D
#define _BF1DEVCFG3_IOL1WAY_MASK                 0x20000000
#define _BF1DEVCFG3_IOL1WAY_LENGTH               0x00000001

#define _BF1DEVCFG3_w_POSITION                   0x00000000
#define _BF1DEVCFG3_w_MASK                       0xFFFFFFFF
#define _BF1DEVCFG3_w_LENGTH                     0x00000020

#define _BF1DEVCFG2_FPLLIDIV_POSITION            0x00000000
#define _BF1DEVCFG2_FPLLIDIV_MASK                0x00000007
#define _BF1DEVCFG2_FPLLIDIV_LENGTH              0x00000003

#define _BF1DEVCFG2_FPLLRNG_POSITION             0x00000004
#define _BF1DEVCFG2_FPLLRNG_MASK                 0x00000070
#define _BF1DEVCFG2_FPLLRNG_LENGTH               0x00000003

#define _BF1DEVCFG2_FPLLICLK_POSITION            0x00000007
#define _BF1DEVCFG2_FPLLICLK_MASK                0x00000080
#define _BF1DEVCFG2_FPLLICLK_LENGTH              0x00000001

#define _BF1DEVCFG2_FPLLMULT_POSITION            0x00000008
#define _BF1DEVCFG2_FPLLMULT_MASK                0x00007F00
#define _BF1DEVCFG2_FPLLMULT_LENGTH              0x00000007

#define _BF1DEVCFG2_FPLLODIV_POSITION            0x00000010
#define _BF1DEVCFG2_FPLLODIV_MASK                0x00070000
#define _BF1DEVCFG2_FPLLODIV_LENGTH              0x00000003

#define _BF1DEVCFG2_BORSEL_POSITION              0x0000001D
#define _BF1DEVCFG2_BORSEL_MASK                  0x20000000
#define _BF1DEVCFG2_BORSEL_LENGTH                0x00000001

#define _BF1DEVCFG2_w_POSITION                   0x00000000
#define _BF1DEVCFG2_w_MASK                       0xFFFFFFFF
#define _BF1DEVCFG2_w_LENGTH                     0x00000020

#define _BF1DEVCFG1_FNOSC_POSITION               0x00000000
#define _BF1DEVCFG1_FNOSC_MASK                   0x00000007
#define _BF1DEVCFG1_FNOSC_LENGTH                 0x00000003

#define _BF1DEVCFG1_DMTINTV_POSITION             0x00000003
#define _BF1DEVCFG1_DMTINTV_MASK                 0x00000038
#define _BF1DEVCFG1_DMTINTV_LENGTH               0x00000003

#define _BF1DEVCFG1_FSOSCEN_POSITION             0x00000006
#define _BF1DEVCFG1_FSOSCEN_MASK                 0x00000040
#define _BF1DEVCFG1_FSOSCEN_LENGTH               0x00000001

#define _BF1DEVCFG1_IESO_POSITION                0x00000007
#define _BF1DEVCFG1_IESO_MASK                    0x00000080
#define _BF1DEVCFG1_IESO_LENGTH                  0x00000001

#define _BF1DEVCFG1_POSCMOD_POSITION             0x00000008
#define _BF1DEVCFG1_POSCMOD_MASK                 0x00000300
#define _BF1DEVCFG1_POSCMOD_LENGTH               0x00000002

#define _BF1DEVCFG1_OSCIOFNC_POSITION            0x0000000A
#define _BF1DEVCFG1_OSCIOFNC_MASK                0x00000400
#define _BF1DEVCFG1_OSCIOFNC_LENGTH              0x00000001

#define _BF1DEVCFG1_FCKSM_POSITION               0x0000000E
#define _BF1DEVCFG1_FCKSM_MASK                   0x0000C000
#define _BF1DEVCFG1_FCKSM_LENGTH                 0x00000002

#define _BF1DEVCFG1_WDTPS_POSITION               0x00000010
#define _BF1DEVCFG1_WDTPS_MASK                   0x001F0000
#define _BF1DEVCFG1_WDTPS_LENGTH                 0x00000005

#define _BF1DEVCFG1_WDTSPGM_POSITION             0x00000015
#define _BF1DEVCFG1_WDTSPGM_MASK                 0x00200000
#define _BF1DEVCFG1_WDTSPGM_LENGTH               0x00000001

