Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0128mca028.h
#define _BF1DEVCFG1_WINDIS_POSITION              0x00000016
#define _BF1DEVCFG1_WINDIS_MASK                  0x00400000
#define _BF1DEVCFG1_WINDIS_LENGTH                0x00000001

#define _BF1DEVCFG1_FWDTEN_POSITION              0x00000017
#define _BF1DEVCFG1_FWDTEN_MASK                  0x00800000
#define _BF1DEVCFG1_FWDTEN_LENGTH                0x00000001

#define _BF1DEVCFG1_FWDTWINSZ_POSITION           0x00000018
#define _BF1DEVCFG1_FWDTWINSZ_MASK               0x03000000
#define _BF1DEVCFG1_FWDTWINSZ_LENGTH             0x00000002

#define _BF1DEVCFG1_DMTCNT_POSITION              0x0000001A
#define _BF1DEVCFG1_DMTCNT_MASK                  0x7C000000
#define _BF1DEVCFG1_DMTCNT_LENGTH                0x00000005

#define _BF1DEVCFG1_FDMTEN_POSITION              0x0000001F
#define _BF1DEVCFG1_FDMTEN_MASK                  0x80000000
#define _BF1DEVCFG1_FDMTEN_LENGTH                0x00000001

#define _BF1DEVCFG1_w_POSITION                   0x00000000
#define _BF1DEVCFG1_w_MASK                       0xFFFFFFFF
#define _BF1DEVCFG1_w_LENGTH                     0x00000020

#define _BF1DEVCFG0_DEBUG_POSITION               0x00000000
#define _BF1DEVCFG0_DEBUG_MASK                   0x00000003
#define _BF1DEVCFG0_DEBUG_LENGTH                 0x00000002

#define _BF1DEVCFG0_JTAGEN_POSITION              0x00000002
#define _BF1DEVCFG0_JTAGEN_MASK                  0x00000004
#define _BF1DEVCFG0_JTAGEN_LENGTH                0x00000001

#define _BF1DEVCFG0_ICESEL_POSITION              0x00000003
#define _BF1DEVCFG0_ICESEL_MASK                  0x00000018
#define _BF1DEVCFG0_ICESEL_LENGTH                0x00000002

#define _BF1DEVCFG0_TRCEN_POSITION               0x00000005
#define _BF1DEVCFG0_TRCEN_MASK                   0x00000020
#define _BF1DEVCFG0_TRCEN_LENGTH                 0x00000001

#define _BF1DEVCFG0_BOOTISA_POSITION             0x00000006
#define _BF1DEVCFG0_BOOTISA_MASK                 0x00000040
#define _BF1DEVCFG0_BOOTISA_LENGTH               0x00000001

#define _BF1DEVCFG0_FECCCON_POSITION             0x00000008
#define _BF1DEVCFG0_FECCCON_MASK                 0x00000300
#define _BF1DEVCFG0_FECCCON_LENGTH               0x00000002

#define _BF1DEVCFG0_FSLEEP_POSITION              0x0000000A
#define _BF1DEVCFG0_FSLEEP_MASK                  0x00000400
#define _BF1DEVCFG0_FSLEEP_LENGTH                0x00000001

#define _BF1DEVCFG0_DBGPER_POSITION              0x0000000C
#define _BF1DEVCFG0_DBGPER_MASK                  0x00007000
#define _BF1DEVCFG0_DBGPER_LENGTH                0x00000003

#define _BF1DEVCFG0_SMCLR_POSITION               0x0000000F
#define _BF1DEVCFG0_SMCLR_MASK                   0x00008000
#define _BF1DEVCFG0_SMCLR_LENGTH                 0x00000001

#define _BF1DEVCFG0_SOSCGAIN_POSITION            0x00000010
#define _BF1DEVCFG0_SOSCGAIN_MASK                0x00030000
#define _BF1DEVCFG0_SOSCGAIN_LENGTH              0x00000002

#define _BF1DEVCFG0_SOSCBOOST_POSITION           0x00000012
#define _BF1DEVCFG0_SOSCBOOST_MASK               0x00040000
#define _BF1DEVCFG0_SOSCBOOST_LENGTH             0x00000001

#define _BF1DEVCFG0_POSCGAIN_POSITION            0x00000013
#define _BF1DEVCFG0_POSCGAIN_MASK                0x00180000
#define _BF1DEVCFG0_POSCGAIN_LENGTH              0x00000002

#define _BF1DEVCFG0_POSCBOOST_POSITION           0x00000015
#define _BF1DEVCFG0_POSCBOOST_MASK               0x00200000
#define _BF1DEVCFG0_POSCBOOST_LENGTH             0x00000001

#define _BF1DEVCFG0_POSCFGAIN_POSITION           0x00000016
#define _BF1DEVCFG0_POSCFGAIN_MASK               0x00C00000
#define _BF1DEVCFG0_POSCFGAIN_LENGTH             0x00000002

#define _BF1DEVCFG0_POSCAGCDLY_POSITION          0x00000018
#define _BF1DEVCFG0_POSCAGCDLY_MASK              0x03000000
#define _BF1DEVCFG0_POSCAGCDLY_LENGTH            0x00000002

#define _BF1DEVCFG0_POSCAGCRNG_POSITION          0x0000001A
#define _BF1DEVCFG0_POSCAGCRNG_MASK              0x04000000
#define _BF1DEVCFG0_POSCAGCRNG_LENGTH            0x00000001

#define _BF1DEVCFG0_POSCAGC_POSITION             0x0000001B
#define _BF1DEVCFG0_POSCAGC_MASK                 0x08000000
#define _BF1DEVCFG0_POSCAGC_LENGTH               0x00000001

#define _BF1DEVCFG0_EJTAGBEN_POSITION            0x0000001E
#define _BF1DEVCFG0_EJTAGBEN_MASK                0x40000000
#define _BF1DEVCFG0_EJTAGBEN_LENGTH              0x00000001

#define _BF1DEVCFG0_FDEBUG_POSITION              0x00000000
#define _BF1DEVCFG0_FDEBUG_MASK                  0x00000003
#define _BF1DEVCFG0_FDEBUG_LENGTH                0x00000002

#define _BF1DEVCFG0_w_POSITION                   0x00000000
#define _BF1DEVCFG0_w_MASK                       0xFFFFFFFF
#define _BF1DEVCFG0_w_LENGTH                     0x00000020

#define _BF1DEVCP_CP_POSITION                    0x0000001C
#define _BF1DEVCP_CP_MASK                        0x10000000
#define _BF1DEVCP_CP_LENGTH                      0x00000001

#define _BF1DEVCP_w_POSITION                     0x00000000
#define _BF1DEVCP_w_MASK                         0xFFFFFFFF
#define _BF1DEVCP_w_LENGTH                       0x00000020

#define _BF1SEQ_TSEQ_POSITION                    0x00000000
#define _BF1SEQ_TSEQ_MASK                        0x0000FFFF
#define _BF1SEQ_TSEQ_LENGTH                      0x00000010

#define _BF1SEQ_CSEQ_POSITION                    0x00000010
#define _BF1SEQ_CSEQ_MASK                        0xFFFF0000
#define _BF1SEQ_CSEQ_LENGTH                      0x00000010

#define _BF1SEQ_w_POSITION                       0x00000000
#define _BF1SEQ_w_MASK                           0xFFFFFFFF
#define _BF1SEQ_w_LENGTH                         0x00000020

/* Vector Numbers */
#define _CORE_TIMER_VECTOR                       0
#define _CORE_SOFTWARE_0_VECTOR                  1
#define _CORE_SOFTWARE_1_VECTOR                  2
#define _EXTERNAL_0_VECTOR                       3
#define _TIMER_1_VECTOR                          4
#define _INPUT_CAPTURE_1_ERROR_VECTOR            5
#define _INPUT_CAPTURE_1_VECTOR                  6
#define _OUTPUT_COMPARE_1_VECTOR                 7
#define _EXTERNAL_1_VECTOR                       8
#define _TIMER_2_VECTOR                          9
#define _INPUT_CAPTURE_2_ERROR_VECTOR            10
#define _INPUT_CAPTURE_2_VECTOR                  11
#define _OUTPUT_COMPARE_2_VECTOR                 12
#define _EXTERNAL_2_VECTOR                       13
#define _TIMER_3_VECTOR                          14
#define _INPUT_CAPTURE_3_ERROR_VECTOR            15
#define _INPUT_CAPTURE_3_VECTOR                  16
#define _OUTPUT_COMPARE_3_VECTOR                 17
#define _EXTERNAL_3_VECTOR                       18
#define _TIMER_4_VECTOR                          19
#define _INPUT_CAPTURE_4_ERROR_VECTOR            20
#define _INPUT_CAPTURE_4_VECTOR                  21
#define _OUTPUT_COMPARE_4_VECTOR                 22
#define _EXTERNAL_4_VECTOR                       23
#define _TIMER_5_VECTOR                          24
#define _RTCC_VECTOR                             30
#define _FLASH_CONTROL_VECTOR                    31
#define _COMPARATOR_1_VECTOR                     32
#define _COMPARATOR_2_VECTOR                     33
#define _SPI1_FAULT_VECTOR                       35
#define _SPI1_RX_VECTOR                          36
#define _SPI1_TX_VECTOR                          37
#define _UART1_FAULT_VECTOR                      38
#define _UART1_RX_VECTOR                         39
#define _UART1_TX_VECTOR                         40
#define _I2C1_BUS_VECTOR                         41
#define _I2C1_SLAVE_VECTOR                       42
#define _I2C1_MASTER_VECTOR                      43
#define _CHANGE_NOTICE_A_VECTOR                  44
#define _CHANGE_NOTICE_B_VECTOR                  45
#define _CHANGE_NOTICE_C_VECTOR                  46
#define _CHANGE_NOTICE_D_VECTOR                  47
#define _SPI2_FAULT_VECTOR                       53
#define _SPI2_RX_VECTOR                          54
#define _SPI2_TX_VECTOR                          55
#define _UART2_FAULT_VECTOR                      56
#define _UART2_RX_VECTOR                         57
#define _UART2_TX_VECTOR                         58
#define _I2C2_BUS_VECTOR                         59
#define _I2C2_SLAVE_VECTOR                       60
#define _I2C2_MASTER_VECTOR                      61
#define _CTMU_VECTOR                             71
#define _DMA0_VECTOR                             72
#define _DMA1_VECTOR                             73
#define _DMA2_VECTOR                             74
#define _DMA3_VECTOR                             75
#define _ADC_VECTOR                              92
#define _ADC_DC1_VECTOR                          94
#define _ADC_DC2_VECTOR                          95
#define _ADC_DF1_VECTOR                          96
#define _ADC_DF2_VECTOR                          97
#define _ADC_FAULT_VECTOR                        100
#define _ADC_EOS_VECTOR                          101
#define _ADC_ARDY_VECTOR                         102
#define _ADC_URDY_VECTOR                         103
#define _ADC_DMA_VECTOR                          104
#define _ADC_EARLY_VECTOR                        105
#define _ADC_DATA0_VECTOR                        106
#define _ADC_DATA1_VECTOR                        107
#define _ADC_DATA2_VECTOR                        108
#define _ADC_DATA3_VECTOR                        109
#define _ADC_DATA4_VECTOR                        110
#define _ADC_DATA5_VECTOR                        111
#define _ADC_DATA13_VECTOR                       119
#define _ADC_DATA15_VECTOR                       121
#define _ADC_DATA16_VECTOR                       122
#define _ADC_DATA17_VECTOR                       123
#define _ADC_DATA50_VECTOR                       156
#define _ADC_DATA53_VECTOR                       159
#define _QEI1_VECTOR                             169
#define _QEI2_VECTOR                             170
#define _PWM_PRI_VECTOR                          171
#define _PWM_SEC_VECTOR                          172
#define _PWM1_VECTOR                             173
#define _PWM2_VECTOR                             174
#define _PWM3_VECTOR                             175
#define _PWM4_VECTOR                             176
#define _DMA4_VECTOR                             182
#define _DMA5_VECTOR                             183
#define _DMA6_VECTOR                             184
#define _DMA7_VECTOR                             185
#define _SYSTEM_BUS_PROTECTION_VECTOR            230
#define _PCACHE_VECTOR                           247
#define _CLC1_VECTOR                             249
#define _CORE_PERF_COUNT_VECTOR                  254
#define _CORE_FAST_DEBUG_CHAN_VECTOR             255

/* Device Peripherals */
#define _ADCHS
#define _CDAC1
#define _CFG
#define _CLC1
#define _CMP1
#define _CMP2
#define _CMP3
#define _CMP4
#define _CMP5
#define _CRU
#define _CTMU
#define _DMAC
#define _DMT
#define _HLVD
#define _I2C1
#define _I2C2
#define _ICAP1
#define _ICAP2
#define _ICAP3
#define _ICAP4
#define _INT
#define _MCPWMCHANNEL
#define _MCPWMMODULE
#define _NVM
#define _OCMP1
#define _OCMP2
#define _OCMP3
#define _OCMP4
#define _PCACHE
#define _PORTA
#define _PORTB
#define _PORTC
#define _PORTD
#define _RTCC
#define _SB
#define _SPI1
#define _SPI2
#define _TMR1
#define _TMR2
#define _TMR3
#define _TMR4
#define _TMR5
#define _UART1
#define _UART2
#define _UARTAB
#define _UARTCD
#define _WDT
#define __DDPSTAT

